window.INITIAL_DATA = {
  "instructor": "Eng. Ahmed El-khatib",
  "courses": [
    {
      "id": "data_communication",
      "name": "Data Communication",
      "nameAr": "تراسل البيانات",
      "groups": [
        {
          "id": "GA",
          "name": "المجموعة 1 (GA)",
          "students": [
            {
              "id": "25010242",
              "name": "ابراهيم حسين إسماعيل محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010243",
              "name": "احمد السيد عباس محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010244",
              "name": "احمد النوبى محمد بغدادى عبد الرحمن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010247",
              "name": "احمد شحات سلامه احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010249",
              "name": "احمد عبد الحميد احمد محمود محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010250",
              "name": "احمد عبد الرحيم محمود احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010253",
              "name": "احمد عبد المالك حراجى محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010254",
              "name": "احمد عثمان مسعود ضيف",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010259",
              "name": "احمد محمد عز الدين على",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010261",
              "name": "احمد موسى احمد موسى على",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010264",
              "name": "احمد ياسر على بدرى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010269",
              "name": "اسراء حسين هلب دردير",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010234",
              "name": "أسماء جابر امين احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010236",
              "name": "أسماء حسين هلب دردير",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010237",
              "name": "أسماء ربيع محمد محمد إسماعيل",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010238",
              "name": "أسماء سيد صحابى احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010239",
              "name": "أسماء محروس حسين محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010272",
              "name": "اشرف حسن محمد حسن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010273",
              "name": "الأسد أبو القاسم أبو المجد عرابى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010275",
              "name": "الزهراء عبد الراضى السيد عبد الراضى الضوى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010282",
              "name": "ايه سعيد مسلم فهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010283",
              "name": "ايه عبد الله محمود محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010286",
              "name": "بافلى عماد حبيب سلامه عوض",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010288",
              "name": "بلال إبراهيم خضرى إبراهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010290",
              "name": "بهاء الدين فنجرى سعدى حامد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010291",
              "name": "بولا صمويل عمانوئيل زكى متى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010292",
              "name": "بيتر عصام حنا اندراوس",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010293",
              "name": "بيتر هانى بشرى صادق",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010294",
              "name": "بيشوى عاطف كامل جاد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010295",
              "name": "تسنيم صلاح عبد الوهاب محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010296",
              "name": "تسنيم عبد الناصر حسن أبو الوفا",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010300",
              "name": "جورج حربى سويرس سيفين",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010301",
              "name": "جون القس جورجيوس وليم أيوب",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010302",
              "name": "حازم احمد حسين احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010303",
              "name": "حازم احمد عطا على عثمان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010304",
              "name": "حازم سعيد مصطفى عبد العليم مصطفى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010307",
              "name": "حبيبه زكريا عبد اللاه محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010309",
              "name": "حبيبه عادل الملك عبد الرحيم فريج",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010310",
              "name": "حبيبه عاطف فهيم محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010313",
              "name": "حبيبه محمود عبد العزيز إبراهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010321",
              "name": "خلود شاذلى عبد المعطى بربرى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010322",
              "name": "داليا عادل احمد مسعود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010327",
              "name": "رانيا عبد الحميد بدرى قاسم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010328",
              "name": "رايفن نشات عياد غبريال خله",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010329",
              "name": "رحمه طه رجب محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010332",
              "name": "رنا عبد السلام عبد الحميد متولى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010336",
              "name": "روضه صلاح محمد احمد جاد الله",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010345",
              "name": "زينب محمد خليل محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010348",
              "name": "ساره اشرف بهى الدين مهنى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010350",
              "name": "ساره حسن محمد إبراهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010353",
              "name": "سلمى منصور عطيه أبو الوفا",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010359",
              "name": "شادى سعد الدين فهمى محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010362",
              "name": "شريف محمود إسماعيل محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010364",
              "name": "صابر محمود سعيد محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010366",
              "name": "صفوان محمد النوبى احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010367",
              "name": "صلاح الدين عاطف صلاح الدين زارع مراد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010370",
              "name": "طارق علاء محمد عبد اللطيف",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010371",
              "name": "طلال حسن يوسف احمد عثمان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010373",
              "name": "عبد الحميد احمد عبد الحميد محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010374",
              "name": "عبد الرحمن احمد رفاعى عبد الراضى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010377",
              "name": "عبد الرحمن جمال سليمان محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010378",
              "name": "عبد الرحمن حسن محمد خليل",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010381",
              "name": "عبد الرحمن محسن محمد احمد",
              "level": "FreshMan",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010385",
              "name": "عبد الرحيم محمد كامل سعيد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010386",
              "name": "عبد العظيم احمد عبد العظيم عثمان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010387",
              "name": "عبد الله احمد عبد الحميد محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010388",
              "name": "عبد الله احمد فضل منوفى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010391",
              "name": "عبد الله سعد عبد الله صديق إبراهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010393",
              "name": "عبد الله عمر محمد عوض إبراهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010394",
              "name": "عبد الله فايد محمد إبراهيم محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010399",
              "name": "علا منتصر احمد على احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010400",
              "name": "على مجدى احمد عبد الجليل",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010401",
              "name": "علياء عبد الناصر محمود عرابى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010402",
              "name": "عمر إبراهيم عبد الكريم عبد الوهاب",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010403",
              "name": "عمر احمد جبريل امين",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010409",
              "name": "عمر محمد عبد السميع احمد محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010410",
              "name": "عمران محمود سعد يوسف",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010411",
              "name": "عمرو دندراوى بشير دندراوى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010412",
              "name": "عمرو عاطف محمد حسانى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010416",
              "name": "فاطمه عبد الهادى حفنى طه",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010420",
              "name": "كاراس أيوب توفيق ذكرى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010422",
              "name": "كريم احمد حجاج محمد ابوزيد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010427",
              "name": "كيرلس شنوده بطرس عطا الله بشاى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010428",
              "name": "لبنى محمد جاد الله احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010434",
              "name": "ماركو القس ميخائيل مينا لبيب",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010437",
              "name": "محمد احمد على محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010439",
              "name": "محمد اشرف طلب أبو اليزيد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010442",
              "name": "محمد ايمن محمد على",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010443",
              "name": "محمد بدوى كمال بدوى الطاهر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010451",
              "name": "محمد رفعت محمود عبد العال",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010452",
              "name": "محمد زكريا فاروق محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010453",
              "name": "محمد سعود التهامى احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010457",
              "name": "محمد عزت جامع احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010462",
              "name": "محمد كمال مصطفى حزين",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010467",
              "name": "محمد محمود محمد عبد الله عثمان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010471",
              "name": "محمود اسامه محمد أبو طالب",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010473",
              "name": "محمود حاتم محمد عبد القادر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010476",
              "name": "محمود صلاح محمود موسى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010480",
              "name": "محمود محمد على عبد العزيز",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010483",
              "name": "مروان عبد الرحيم خليفه مبارك",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010484",
              "name": "مروان محمد سعد الدين حسانى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010487",
              "name": "مروان محمود محمد توفيق",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010489",
              "name": "مريم بدوى محمود محمد",
              "level": "FreshMan",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010492",
              "name": "مريم عصام عوض إسماعيل",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010498",
              "name": "مريم يوسف حامد محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010499",
              "name": "مريم يوسف محمد أبو الحجاج",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010502",
              "name": "مصطفى احمد عبيد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010504",
              "name": "مصطفى محمد سعد عبد الجليل",
              "level": "FreshMan",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010510",
              "name": "منه الله على سعيد على",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010515",
              "name": "ندى طلعت محمد تميم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010516",
              "name": "ندى علاء أبو القاسم محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010526",
              "name": "ياسين حسين محمد محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010528",
              "name": "يوستينا عادل جابر توما",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010531",
              "name": "يوسف احمد يوسف محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010535",
              "name": "يوسف رجب عبد الفتاح على",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010537",
              "name": "يوسف عبد النعيم حسن قاسم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010003",
              "name": "ابراهيم رمضان احمد سليم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010009",
              "name": "احمد تامر إبراهيم عبد اللطيف",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010014",
              "name": "احمد حسن محمد حسانى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010021",
              "name": "احمد عبود احمد محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010023",
              "name": "احمد محمد احمد محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010031",
              "name": "اروه عادل جابر الأمير",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010032",
              "name": "اروى حسن على عبد الله",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010033",
              "name": "اريج محى الدين إبراهيم يوسف",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010034",
              "name": "اسراء احمد مصطفى حسين",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010035",
              "name": "اسراء صلاح سعد سعيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010002",
              "name": "اسماء الزين عيد عبد الحميد احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010045",
              "name": "ايمن عصام محمد حامد محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010049",
              "name": "باسم ناصر عياد ارمانيوس",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010051",
              "name": "بشار أبو الحسن محمود إسماعيل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010052",
              "name": "بيشوى صلاح صبحى واصف",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010053",
              "name": "ثويبه على بكرى احمد على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010054",
              "name": "جرجس عادل جيد مترى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010058",
              "name": "جوزيف عبد المسيح شحاته عبد النور",
              "level": "FreshMan",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010060",
              "name": "حبيبه حسن احمد محمد احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010063",
              "name": "حسن احمد سعيد احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010067",
              "name": "حور خالد محمد احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010078",
              "name": "روان حسن محمد نور الدين",
              "level": "FreshMan",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010079",
              "name": "روزان خطاب حمدان عابد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010097",
              "name": "شهد محمد احمد عبد الوهاب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010103",
              "name": "طارق مصطفى محمد مصطفى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010106",
              "name": "طه محمد طه احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010112",
              "name": "عبد الرحمن حاتم ناجى رضوان محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010121",
              "name": "عبد الله ابو زيد محمد بكرى حسن",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010124",
              "name": "عبد الله حمزه محمد حمزه",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010129",
              "name": "عمر مصطفى احمد محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010137",
              "name": "فلوباتير يوحنا صبرى عطيه",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010138",
              "name": "كارمينا صفوت فخرى ابادير",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010147",
              "name": "ماريا ميلاد سعد عبد الله",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010152",
              "name": "محمد الشاذلى محمد جبريل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010156",
              "name": "محمد حجاج محمد موسى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010170",
              "name": "محمد على مصطفى النحاس عارف احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010178",
              "name": "محمد وليد فراج احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010179",
              "name": "محمود احمد عبد العظيم عبد اللطيف",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010481",
              "name": "مرام مصطفى عبد الحميد محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010190",
              "name": "مصطفى احمد عبد الخالق ثروت",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010191",
              "name": "مصطفى اسامه الطاهر أبو دوح",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010192",
              "name": "مصطفى بكرى امين عمر",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010195",
              "name": "مصطفى محمد احمد العبد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010196",
              "name": "مصطفى هانى السيد محمد أبو سالم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010198",
              "name": "مكاريوس عماد اسماك مكسيموس",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010217",
              "name": "ولاء وليد سيد محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010223",
              "name": "يسى اشرف جرجس إبراهيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010225",
              "name": "يوسف إبراهيم دانيال حبيب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            }
          ],
          "instructor": "م. أحمد الخطيب",
          "instructorId": "ahmed"
        },
        {
          "id": "GB",
          "name": "المجموعة 2 (GB)",
          "students": [
            {
              "id": "25010246",
              "name": "احمد حسام خضرى حفنى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010248",
              "name": "احمد عاطف احمد أبو الفضل",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010251",
              "name": "احمد عبد الرسول احمد ادم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010263",
              "name": "احمد ياسر عبد النبى زرور",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010267",
              "name": "اسامه عبد الوكيل محمد إسماعيل",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010276",
              "name": "الشيماء حسين محمد محمود احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010281",
              "name": "ايه احمد قاسم عبد الرحيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010284",
              "name": "ايه على محمود على",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010285",
              "name": "باسم محمد حسن احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010308",
              "name": "حبيبه زين العابدين احمد عبد العظيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010317",
              "name": "حسين محمد سعد محمد حمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010323",
              "name": "داليا عبد الحليم احمد حفنى الطاهر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010325",
              "name": "رؤيه ايمن محمد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010334",
              "name": "روان محمد يوسف محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010338",
              "name": "ريم سيد طه إبراهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010339",
              "name": "ريماس عماد محمود حامد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010342",
              "name": "زياد اشرف محمد حسن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010349",
              "name": "ساره امين سانوسى امين",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010351",
              "name": "ساميه محمد إبراهيم عبد الجليل",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010354",
              "name": "سمامحمود محمد عبد الواحد سالم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010356",
              "name": "سندس خالد عبد الرسول الناصح",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010357",
              "name": "سندس عبد الصبور ربيع محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010358",
              "name": "سهام مصطفى عبد المنعم عبد الدايم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010360",
              "name": "شروق رجب سيد محمود بخيت",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010363",
              "name": "شهد ممدوح يسن بدرى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010100",
              "name": "ضحى احمد عبد الكريم احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010368",
              "name": "ضحى عبد الستار النجار محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010541",
              "name": "عبد الرحمن اشرف محمد على سليمان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010379",
              "name": "عبد الرحمن رجب محمد أحمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010380",
              "name": "عبد الرحمن عماد محمود عيسى محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010383",
              "name": "عبد الرحمن معتصم حسن عبد الغفار مطاوع",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010384",
              "name": "عبد الرحمن هاشم محمود محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010389",
              "name": "عبد الله ايمن مصطفى عبد الوهاب هلال",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010395",
              "name": "عبد الله محمد عطيه فرج عطيه",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010398",
              "name": "عبد الله محمود محمد محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010404",
              "name": "عمر احمد عبد الحميد محمد الدريرى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010405",
              "name": "عمر احمد محمد عبده",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010406",
              "name": "عمر خالد محمد المشهور خليل فهيم عبد الصمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010408",
              "name": "عمر محمد حلمى أبو الوفا عامر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010414",
              "name": "غاده محمود عبد اللطيف محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010415",
              "name": "فاطمه عبد الرؤوف محمد إبراهيم عبد الله",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010418",
              "name": "قاسم حمدى على احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010421",
              "name": "كرم احمد عباس محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010424",
              "name": "كريم عبد السميع عبد النظير عبد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010430",
              "name": "مؤمن علاء عبد الرؤوف محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010431",
              "name": "مؤمن محمد حامد عبد اللطيف طه",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010435",
              "name": "ماريو فتح الله جرجس روفائيل جرجس",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010436",
              "name": "محمد احمد سليم محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010440",
              "name": "محمد السيد فهمى محمد السيد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010441",
              "name": "محمد ايمن محمد حسن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010444",
              "name": "محمد جمال احمد عبد القادر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010445",
              "name": "محمد حسن محمد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010446",
              "name": "محمد حسين محمد حسين",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010447",
              "name": "محمد خالد أبو المجد رضوان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010448",
              "name": "محمد ربيع مهدى غزالى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010454",
              "name": "محمد شريف محمد يونس",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010455",
              "name": "محمد صابر محمد مصري",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010459",
              "name": "محمد عصام محمد جمال مصطفى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010542",
              "name": "محمد محمود لطفى محمود",
              "level": "FreshMan",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010469",
              "name": "محمد هيسم عبد العزيز إبراهيم سلامه",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010479",
              "name": "محمود محمد حشمت عوض الله",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010491",
              "name": "مريم خالد فؤاد محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010500",
              "name": "مصطفى إبراهيم محمد على",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010501",
              "name": "مصطفى احمد عبد السميع احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010505",
              "name": "معتز احمد عبد السميع احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010507",
              "name": "ملك ممدوح احمد يوسف",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010508",
              "name": "منه الله جمال الزهرى حسانين",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010509",
              "name": "منه الله عبد الناصر محمود احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010513",
              "name": "ناديه ايمن أبو ضيف عبد الحميد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010514",
              "name": "نجوى محمد إبراهيم محمد نصار",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010517",
              "name": "نوران ايمن محمد حسان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010527",
              "name": "يحيى وحيد فتحى محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010530",
              "name": "يوسف احمد مرتضى مختار",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010532",
              "name": "يوسف اشرف عبد الحميد رضوان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010533",
              "name": "يوسف ايمن رفاعى السيد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010534",
              "name": "يوسف بغدادى سيد احمد إبراهيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010538",
              "name": "يوسف فتحى أبو الفضل مصطفى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010539",
              "name": "يوسف محسن صابر عبد الرازق",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010540",
              "name": "يوسف محمد السيد مصطفى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010004",
              "name": "ابراهيم قناوى عطيه حسين إبراهيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010008",
              "name": "احمد الطيب الناجى السيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010010",
              "name": "احمد جمال النوبى عبد الحكيم كريم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010012",
              "name": "احمد حجاج حامد سيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010016",
              "name": "احمد ربيع احمد مرغنى جاد الله",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010018",
              "name": "احمد سعيد عبد الله بسطاوى سيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010019",
              "name": "احمد صلاح محمد الطاهر",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010026",
              "name": "احمد محمود احمد امين",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010029",
              "name": "احمد هشام سيد عبد المحسن",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010038",
              "name": "الاء حامد حسن عبد اللاه",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010277",
              "name": "المدثر ايمن حرز الله محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010043",
              "name": "انطونيوس سامح لبيب بطرس",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010046",
              "name": "ايه بدوى محمد حسنى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010047",
              "name": "ايه يحيى عبد الفتاح محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010055",
              "name": "جمال عبد الناصر عابدين على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010057",
              "name": "جورج ريمون عياد فوزى عبد السميح",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010059",
              "name": "حبيبه حسان عبد العاطى احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010061",
              "name": "حبيبه محمد الأمير حسن فؤاد عامر محمد النوبى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010065",
              "name": "حلا وائل ابراهيم محمود الخطاط",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010070",
              "name": "ديفيد بهجت ملاك خليل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010080",
              "name": "ريتاج صالحين احمد صالحين محمود",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010081",
              "name": "ريحان محمد عبد الجواد عبد الواحد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010082",
              "name": "زكريا عبد الفتاح عباس أحمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010084",
              "name": "زياد الحسينى محمد الامير عبدالله",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010095",
              "name": "سيد محمد مصطفى عبد الهادى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010096",
              "name": "سيف محمد عبده محمد",
              "level": "FreshMan",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010107",
              "name": "عبد الحميد مرتضى محمد عبد الخالق قناوى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010110",
              "name": "عبد الرحمن احمد كامل علام",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010113",
              "name": "عبد الرحمن حسن محمد حسن",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010114",
              "name": "عبد الرحمن خالد إسماعيل محمود",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010130",
              "name": "عمر هاشم محمد فراج",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010141",
              "name": "كريم طارق عبد الباسط محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010144",
              "name": "لجين امير على محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010145",
              "name": "مارك جرجس عزت نصر سفين",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010146",
              "name": "ماركو عصام عزت رشدى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010148",
              "name": "مالك احمد فريد احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010150",
              "name": "محمد احمد كمال فؤاد كريم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010153",
              "name": "محمد الفى محمد حميد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010155",
              "name": "محمد جلال فوزى هاشم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010158",
              "name": "محمد حمدى نوبى احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010160",
              "name": "محمد خضر محمد طه احمد النجار",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010161",
              "name": "محمد زكريا حسين محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010162",
              "name": "محمد سيد عبده احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010168",
              "name": "محمد على محمد احمد على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010172",
              "name": "محمد محى الدين إبراهيم يوسف إبراهيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010173",
              "name": "محمد ممدوح توفيق عفيفى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010174",
              "name": "محمد ممدوح نوبى على عبد الرحيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010177",
              "name": "محمد نتيعى عبد المحسن منصور حجازى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010180",
              "name": "محمود جمال محمد موسى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010187",
              "name": "مروان محمود احمد محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010188",
              "name": "مريم عبد الحميد احمد احمد ابراهيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010189",
              "name": "مريم محمد عبد العزيز يوسف",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010193",
              "name": "مصطفى رمضان محمود احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010199",
              "name": "ملك فراج صلاح الدين يونس احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010201",
              "name": "منه على عدوى على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010202",
              "name": "مها خالد على احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010218",
              "name": "ياسمين محمد سيد عبد الرحيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010220",
              "name": "يحيى احمد زكى عبدون",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010221",
              "name": "يحيى خيرى محمد ادم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010222",
              "name": "يس ايمن محمد سيد محمود",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010228",
              "name": "يوسف عبد المعز أبو المجد حسن حسين",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010229",
              "name": "يوسف محمد احمد يوسف محمد مهنا",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010233",
              "name": "يوسف ياسر محفوظ صليح",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            }
          ],
          "instructor": "م. أحمد الخطيب",
          "instructorId": "ahmed"
        },
        {
          "id": "GC",
          "name": "المجموعة 3 (GC)",
          "students": [
            {
              "id": "25010245",
              "name": "احمد ايمن سعد ربيع",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010255",
              "name": "احمد على يعقوب حامد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010256",
              "name": "احمد محمد احمد عبد العظيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010258",
              "name": "احمد محمد عبد الله على مخيمر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010265",
              "name": "اروى الشاذلى عبيد زكى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010266",
              "name": "اروى حسن مغربى سليم مراد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010268",
              "name": "اسامه محمد ابو الحجاج محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010270",
              "name": "اسراء لطفى محمد حسانين احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010235",
              "name": "أسماء حسن احمد بكرى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010271",
              "name": "اسمى عادل عبد الفتاح عمر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010274",
              "name": "البراء عمر إبراهيم وفا حسن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010278",
              "name": "امنه محمود محمد يسين",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010279",
              "name": "اياد هانى عاطف شفيق مصطفى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010280",
              "name": "ايرينى ميخائيل فوزى إسكندر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010287",
              "name": "بسمه إبراهيم إسماعيل إبراهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010289",
              "name": "بلال احمد محمود عبد العال",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010298",
              "name": "جرجس فايز نجيب جبره شنوده",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010299",
              "name": "جنه عامر حسن عبد الظاهر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010305",
              "name": "حبيبه أبو المعارف محمد وحيد محمد الحفنى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010306",
              "name": "حبيبه اصولى شحات حفنى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010311",
              "name": "حبيبه علاء احمد محمد النوبى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010312",
              "name": "حبيبه محمد عبده محمد خميس",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010315",
              "name": "حسن عبد الله حسن محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010318",
              "name": "حمزه رمضان احمد محمد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010319",
              "name": "حنين اسامه محمد السيد حسن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010320",
              "name": "حنين رمضان سعدى احمد حسن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010324",
              "name": "رؤى عبد الناصر النوبى عزيز",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010326",
              "name": "رانيا احمد شوقى احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010330",
              "name": "رقيه محمود احمد محمد احمد الطيب",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010331",
              "name": "رنا حجاج محمد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010335",
              "name": "روضه سعدى رشيدى حسن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010337",
              "name": "ريتاج محمد احمدانى عبد النظير",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010340",
              "name": "زياد اشرف احمد اسماعيل",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010341",
              "name": "زياد اشرف سعيد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010343",
              "name": "زياد ممدوح زين العابدين احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010344",
              "name": "زينب احمد محمد بسطاوى مرسى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010346",
              "name": "زينب منصور جاد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010347",
              "name": "ساره احمد يوسف سيد الدالى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010352",
              "name": "سجى اشرف مصطفى مصطفى محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010355",
              "name": "سميه ياسر عبد الغنى محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010365",
              "name": "صابرين احمد محمد الطيب احمد على",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010372",
              "name": "عادل محمود عادل امين",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010376",
              "name": "عبد الرحمن تقى احمد عبد الموجود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010392",
              "name": "عبد الله عبد الفتاح سعيد محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010396",
              "name": "عبد الله محمد نصر مسكين سليمان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010397",
              "name": "عبد الله محمود سعد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010407",
              "name": "عمر قناوى محمود عبد النبى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010413",
              "name": "غاده إسماعيل فهمى إسماعيل",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010417",
              "name": "فهد محمود مريد دسوقى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010419",
              "name": "كاترين إسحاق نعيم بسخرون",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010423",
              "name": "كريم احمد كامل عليان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010426",
              "name": "كريم محمد رشاد عبد العال جاد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010429",
              "name": "ليديا ضياء انسى جرجس",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010432",
              "name": "مؤيد محروس محمد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010433",
              "name": "ما هيتاب أبو طالب الخضرى احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010438",
              "name": "محمد احمد محمد عبد الله حجاجى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010449",
              "name": "محمد رفعت عبد الغنى محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010450",
              "name": "محمد رفعت محمد حسين",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010456",
              "name": "محمد عبد المحسن عبد اللطيف إبراهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010458",
              "name": "محمد عصام عبد الفتاح محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010460",
              "name": "محمد علاء خليفه رفاعى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010464",
              "name": "محمد محمود فنجرى عبد الله",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010466",
              "name": "محمد محمود محمد عبد الراضى محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010468",
              "name": "محمد مصطفى محمد محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010472",
              "name": "محمود الشاذلى احمد الشاذلى عاشور",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010474",
              "name": "محمود خالد محمود محمد العبد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010478",
              "name": "محمود محمد النوبى رضوان",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010485",
              "name": "مروان محمد سيد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010486",
              "name": "مروان محمد عباس حسن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010488",
              "name": "مريم احمد سيد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010493",
              "name": "مريم على محمدين احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010494",
              "name": "مريم مجاهد العادلى عمر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010495",
              "name": "مريم محمود فكرى أبو الحمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010496",
              "name": "مريم وائل سمير شكرى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010497",
              "name": "مريم وجيه حليم إسكندر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010503",
              "name": "مصطفى سهرى احمد عبد العظيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010506",
              "name": "ملك احمد عبد الهادى محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010512",
              "name": "ميرنا جون ادوارد سوريال",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010518",
              "name": "نوران عادل أبو الوفا حامد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010521",
              "name": "نوران هانى عبد الرحمن ركابى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010522",
              "name": "هايدى محمد فوزى حسن امام",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010523",
              "name": "هشام حمدى محمد مهران",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010524",
              "name": "وئام حسين عبد الجليل محمد عبد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010525",
              "name": "ياسمين محى الدين احمد محمود",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010529",
              "name": "يوسف احمد عباس محمد محمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010536",
              "name": "يوسف عبد الله حسن محمد مطر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010005",
              "name": "احمد إسماعيل بكرى إسماعيل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010006",
              "name": "احمد الحسينى الطاهر مهدى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010007",
              "name": "احمد السيد محمد الصادق احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010011",
              "name": "احمد حامد عبد العزيز احمد فاوى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010013",
              "name": "احمد حسن عبد الستار محمد إبراهيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010020",
              "name": "احمد عبد اللاه عبد الحاكم كامل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010024",
              "name": "احمد محمد احمد محمد محمود",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010025",
              "name": "احمد محمد صلاح عبد العال محمد جبر",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010027",
              "name": "احمد محمود عبدوا عبد الحاكم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010036",
              "name": "اسلام ايمن عبيد جريو حسن",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010001",
              "name": "اسماء احمد عبد المولى محمد عبد الحليم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010039",
              "name": "الاء سيد مصطفى عبد السيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010040",
              "name": "الاء شعبان جلال فراج",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010042",
              "name": "اميمه بركات محمد عبد الرحمن",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010044",
              "name": "ايمن احمد كامل على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010048",
              "name": "باسل محمد على احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010050",
              "name": "بسمه طواب كمال على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010056",
              "name": "جنى هانى عادل محمد البراجه",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010062",
              "name": "حسام الدين محمد محمود محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010064",
              "name": "حسناء فتحى الأمير محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010066",
              "name": "حمد محسن وهبى على بك حسن",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010068",
              "name": "خالد عبد الناصر محمد كامل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010069",
              "name": "خالد محمد عبد القادر محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010071",
              "name": "ديفيد سامى برنابا ادوارد لبيب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010072",
              "name": "دينا عبد الله احمد بصرى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010073",
              "name": "رؤى عماد محمد حسين",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010075",
              "name": "رضوى رافت كمال محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010076",
              "name": "رنا احمد عبد اللطيف محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010077",
              "name": "رنا عبد الحق محمد تهامى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010086",
              "name": "زياد محمود رفاعى العزب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010087",
              "name": "ساره احمد السيد على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010088",
              "name": "ساندى سامح عبد الله قسطنجى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010089",
              "name": "ساندى سامح عبد المسيح سامى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010091",
              "name": "سلمى ابراهيم سالم حبيب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010092",
              "name": "سلمى احمد عبد اللاه عبد الرشيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010094",
              "name": "سلمى هشام حسن احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010101",
              "name": "ضياء رجب حسين محمود",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010102",
              "name": "طارق محمود عبد الرحيم على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010104",
              "name": "طاهر اسامه الطاهر ابودوح عبد الغفار",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010105",
              "name": "طاهر حسين طاهر احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010109",
              "name": "عبد الرحمن احمد زكى ابو الحسن",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010108",
              "name": "عبد الرحمن انور بكرى جاد الرب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010115",
              "name": "عبد الرحمن خالد احمد امين محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010116",
              "name": "عبد الرحمن عاطف حسين على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010117",
              "name": "عبد الرحمن عصام رمضان حافظ",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010118",
              "name": "عبد الرحمن محمد قهرى احمد بدوى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010119",
              "name": "عبد الرحمن محمود عبد القادر محمد خليل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010122",
              "name": "عبد الله احمد عبد الدايم محمد الفرغلى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010123",
              "name": "عبد الله جمال الدين محمد على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010126",
              "name": "عبد الوهاب محمود ياقوت عبد الوهاب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010127",
              "name": "عثمان محمد على نور الدين",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010128",
              "name": "على محمد اشرف عبد المعطى محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010131",
              "name": "عمرو ابراهيم ابراهيم محمد السحيمى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010132",
              "name": "عمرو احمد محمد المذنى حسن عبد الله",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010133",
              "name": "عمرو جمال حسين خليل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010135",
              "name": "فاطمه احمد محمد عبد السلام",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010136",
              "name": "فاطمه شوقى كمال على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010139",
              "name": "كريم بهاء الدين محمد على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010142",
              "name": "كريم محمد عبد الحافظ طه",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010143",
              "name": "كريم محمود محمد مصطفى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010149",
              "name": "محمد أبو الحجاج عبد الوهاب حسن احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010154",
              "name": "محمد ايمن حسين عبد المبدى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010159",
              "name": "محمد خالد محمد حسانين",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010163",
              "name": "محمد صالح مسعود احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010164",
              "name": "محمد صبرى عطيتو بغدادى قرقار",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010165",
              "name": "محمد عبد الحميد محمد احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010167",
              "name": "محمد عبده رفاعى حسن",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010169",
              "name": "محمد على محمد عبد القادر",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010171",
              "name": "محمد محمود محمد سعيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010175",
              "name": "محمد منتصر سليمان محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010182",
              "name": "محمود صبرى محمود دياب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010184",
              "name": "محمود محمد احمد محمود",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010185",
              "name": "محمود ناصر محمود عفيفى الزوبرى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010482",
              "name": "مروان شريف محمد السيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010186",
              "name": "مروان محمد بدوى محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010194",
              "name": "مصطفى سعد محمود محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010197",
              "name": "معاذ احمد انور محمد شمررخ",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010200",
              "name": "ممدوح اسعد محمد داود",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010203",
              "name": "مى احمد بدوى إبراهيم عبد الدايم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010204",
              "name": "مينا جرجس فوزى منسى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010205",
              "name": "نادين رمضان عيد إبراهيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010207",
              "name": "ندى خالد احمد إبراهيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010209",
              "name": "نور الدين محمود احمد جلالين",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010210",
              "name": "نور سعيد محمد اسماعيل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010211",
              "name": "نور علاء الدين إبراهيم على صقر",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010213",
              "name": "هدايه سيد محمد النوبى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010214",
              "name": "هدى أبو المجد مصطفى أبو زيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010215",
              "name": "وسام شعبان الديب الراوى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010216",
              "name": "ولاء فتحى العادلى الطاهر",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010219",
              "name": "يحى محمد عبد الوهاب محمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010227",
              "name": "يوسف اشرف احمد عبد العظيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010231",
              "name": "يوسف محمود سيد كامل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010232",
              "name": "يوسف محمود محمد حسنين احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            }
          ],
          "instructor": "م. أحمد الخطيب",
          "instructorId": "ahmed"
        }
      ],
      "instructors": [
        "ahmed"
      ]
    },
    {
      "id": "operating_systems",
      "name": "Operating Systems",
      "nameAr": "نظم التشغيل",
      "groups": [
        {
          "id": "S15",
          "name": "سكشن 15 (Section 15)",
          "students": [
            {
              "id": "25010258",
              "name": "احمد محمد عبد الله على مخيمر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010235",
              "name": "أسماء حسن احمد بكرى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010280",
              "name": "ايرينى ميخائيل فوزى إسكندر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010287",
              "name": "بسمه إبراهيم إسماعيل إبراهيم",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010311",
              "name": "حبيبه علاء احمد محمد النوبي",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010312",
              "name": "حبيبه محمد عبده محمد خميس",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010319",
              "name": "حنين اسامه محمد السيد حسن",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010344",
              "name": "زينب احمد محمد بسطاوى مرسى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010346",
              "name": "زينب منصور جاد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010419",
              "name": "كاترين إسحاق نعيم بسخرون",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010429",
              "name": "ليديا ضياء انسى جرجس",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010433",
              "name": "ما هيتاب أبو طالب الخضرى احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010488",
              "name": "مريم احمد سيد احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010493",
              "name": "مريم على محمدين احمد",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010494",
              "name": "مريم مجاهد العادلى عمر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010496",
              "name": "مريم وائل سمير شكرى",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010497",
              "name": "مريم وجيه حليم إسكندر",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010503",
              "name": "مصطفى سهرى احمد عبد العظيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010512",
              "name": "ميرنا جون ادوارد سوريال",
              "level": "Sophomore",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010522",
              "name": "هايدى محمد فوزى حسن امام",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010050",
              "name": "بسمه طواب كمال على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010072",
              "name": "دينا عبد الله احمد بصرى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010086",
              "name": "زياد محمود رفاعى العزب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010088",
              "name": "ساندى سامح عبد الله قسطنجى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010089",
              "name": "ساندى سامح عبد المسيح سامى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010105",
              "name": "طاهر حسين طاهر احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010123",
              "name": "عبد الله جمال الدين محمد على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010126",
              "name": "عبد الوهاب محمود ياقوت عبد الوهاب",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010136",
              "name": "فاطمه شوقى كمال على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010139",
              "name": "كريم بهاء الدين محمد على",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010143",
              "name": "كريم محمود محمد مصطفى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010149",
              "name": "محمد أبو الحجاج عبد الوهاب حسن احمد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010210",
              "name": "نور سعيد محمد اسماعيل",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010214",
              "name": "هدى أبو المجد مصطفى أبو زيد",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010215",
              "name": "وسام شعبان الديب الراوى",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010227",
              "name": "يوسف اشرف احمد عبد العظيم",
              "level": "Sophomore",
              "program": "الأمن السيبراني"
            }
          ],
          "instructor": "م. أحمد الخطيب",
          "instructorId": "ahmed"
        },
        {
          "id": "S10",
          "name": "سكشن 10 (S10)",
          "instructor": "م. إنجي",
          "instructorId": "engy",
          "students": [
            {
              "id": "25010251",
              "name": "احمد عبد الرسول احمد ادم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010267",
              "name": "اسامه عبد الوكيل محمد إسماعيل",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010276",
              "name": "الشيماء حسين محمد محمود احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010281",
              "name": "ايه احمد قاسم عبد الرحيم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010339",
              "name": "ريماس عماد محمود حامد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010351",
              "name": "ساميه محمد إبراهيم عبد الجليل",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010356",
              "name": "سندس خالد عبد الرسول الناصح",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010360",
              "name": "شروق رجب سيد محمود بخيت",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010363",
              "name": "شهد ممدوح يسن بدرى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010100",
              "name": "ضحى احمد عبد الكريم احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010383",
              "name": "عبد الرحمن معتصم حسن عبد الغفار مطاوع",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010398",
              "name": "عبد الله محمود محمد محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010436",
              "name": "محمد احمد سليم محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010530",
              "name": "يوسف احمد مرتضى مختار",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010532",
              "name": "يوسف اشرف عبد الحميد رضوان",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010534",
              "name": "يوسف بغدادى سيد احمد إبراهيم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010538",
              "name": "يوسف فتحى أبو الفضل مصطفى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010539",
              "name": "يوسف محسن صابر عبد الرازق",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010540",
              "name": "يوسف محمد السيد مصطفى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010004",
              "name": "ابراهيم قناوى عطيه حسين إبراهيم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010010",
              "name": "احمد جمال النوبى عبد الحكيم كريم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010016",
              "name": "احمد ربيع احمد مرغنى جاد الله",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010029",
              "name": "احمد هشام سيد عبد المحسن",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010043",
              "name": "انطونيوس سامح لبيب بطرس",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010047",
              "name": "ايه يحيى عبد الفتاح محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010061",
              "name": "حبيبه محمد الأمير حسن فؤاد عامر محمد النوبى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010081",
              "name": "ريحان محمد عبد الجواد عبد الواحد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010110",
              "name": "عبد الرحمن احمد كامل علام",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010141",
              "name": "كريم طارق عبد الباسط محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010145",
              "name": "مارك جرجس عزت نصر سفين",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010150",
              "name": "محمد احمد كمال فؤاد كريم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010161",
              "name": "محمد زكريا حسين محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010162",
              "name": "محمد سيد عبده احمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010187",
              "name": "مروان محمود احمد محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010218",
              "name": "ياسمين محمد سيد عبد الرحيم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010233",
              "name": "يوسف ياسر محفوظ صليح",
              "program": "الأمن السيبراني"
            }
          ]
        },
        {
          "id": "S14",
          "name": "سكشن 14 (S14)",
          "instructor": "م. إنجي",
          "instructorId": "engy",
          "students": [
            {
              "id": "25010245",
              "name": "احمد ايمن سعد ربيع",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010255",
              "name": "احمد على يعقوب حامد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010266",
              "name": "اروى حسن مغربى سليم مراد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010278",
              "name": "امنه محمود محمد يسين",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010335",
              "name": "روضه سعدى رشيدى حسن",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010337",
              "name": "ريتاج محمد احمدانى عبد النظير",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010341",
              "name": "زياد اشرف سعيد احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010365",
              "name": "صابرين احمد محمد الطيب احمد على",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010397",
              "name": "عبد الله محمود سعد احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010417",
              "name": "فهد محمود مريد دسوقى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010450",
              "name": "محمد رفعت محمد حسين",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010464",
              "name": "محمد محمود فنجرى عبد الله",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010472",
              "name": "محمود الشاذلى احمد الشاذلى عاشور",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010486",
              "name": "مروان محمد عباس حسن",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010495",
              "name": "مريم محمود فكرى أبو الحمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010506",
              "name": "ملك احمد عبد الهادى محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010524",
              "name": "وئام حسين عبد الجليل محمد عبد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010529",
              "name": "يوسف احمد عباس محمد محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010005",
              "name": "احمد إسماعيل بكرى إسماعيل",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010006",
              "name": "احمد الحسينى الطاهر مهدى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010027",
              "name": "احمد محمود عبدوا عبد الحاكم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010001",
              "name": "اسماء احمد عبد المولى محمد عبد الحليم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010042",
              "name": "اميمه بركات محمد عبد الرحمن",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010064",
              "name": "حسناء فتحى الأمير محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010073",
              "name": "رؤى عماد محمد حسين",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010077",
              "name": "رنا عبد الحق محمد تهامى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010092",
              "name": "سلمى احمد عبد اللاه عبد الرشيد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010119",
              "name": "عبد الرحمن محمود عبد القادر محمد خليل",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010133",
              "name": "عمرو جمال حسين خليل",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010135",
              "name": "فاطمه احمد محمد عبد السلام",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010163",
              "name": "محمد صالح مسعود احمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010164",
              "name": "محمد صبرى عطيتو بغدادى قرقار",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010167",
              "name": "محمد عبده رفاعى حسن",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010203",
              "name": "مى احمد بدوى إبراهيم عبد الدايم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010209",
              "name": "نور الدين محمود احمد جلالين",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010216",
              "name": "ولاء فتحى العادلى الطاهر",
              "program": "الأمن السيبراني"
            }
          ]
        },
        {
          "id": "S6",
          "name": "سكشن 6 (S6)",
          "instructor": "م. إنجي",
          "instructorId": "engy",
          "students": [
            {
              "id": "25010284",
              "name": "ايه على محمود على",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010368",
              "name": "ضحى عبد الستار النجار محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010380",
              "name": "عبد الرحمن عماد محمود عيسى محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010408",
              "name": "عمر محمد حلمى أبو الوفا عامر",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010542",
              "name": "محمد محمود لطفى محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010509",
              "name": "منه الله عبد الناصر محمود احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010527",
              "name": "يحيى وحيد فتحى محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010018",
              "name": "احمد سعيد عبد الله بسطاوى سيد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010038",
              "name": "الاء حامد حسن عبد اللاه",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010277",
              "name": "المدثر ايمن حرز الله محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010096",
              "name": "سيف محمد عبده محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010113",
              "name": "عبد الرحمن حسن محمد حسن",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010155",
              "name": "محمد جلال فوزى هاشم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010228",
              "name": "يوسف عبد المعز أبو المجد حسن حسين",
              "program": "الأمن السيبراني"
            }
          ]
        },
        {
          "id": "S8",
          "name": "سكشن 8 (S8)",
          "instructor": "م. إنجي",
          "instructorId": "engy",
          "students": [
            {
              "id": "25010358",
              "name": "سهام مصطفى عبد المنعم عبد الدايم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010384",
              "name": "عبد الرحمن هاشم محمود محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010395",
              "name": "عبد الله محمد عطيه فرج عطيه",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010491",
              "name": "مريم خالد فؤاد محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010513",
              "name": "ناديه ايمن أبو ضيف عبد الحميد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010046",
              "name": "ايه بدوى محمد حسنى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010057",
              "name": "جورج ريمون عياد فوزى عبد السميح",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010065",
              "name": "حلا وائل ابراهيم محمود الخطاط",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010082",
              "name": "زكريا عبد الفتاح عباس أحمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010095",
              "name": "سيد محمد مصطفى عبد الهادى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010107",
              "name": "عبد الحميد مرتضى محمد عبد الخالق قناوى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010130",
              "name": "عمر هاشم محمد فراج",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010153",
              "name": "محمد الفى محمد حميد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010160",
              "name": "محمد خضر محمد طه احمد النجار",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010172",
              "name": "محمد محى الدين إبراهيم يوسف إبراهيم",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010173",
              "name": "محمد ممدوح توفيق عفيفى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010177",
              "name": "محمد نتيعى عبد المحسن منصور حجازى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010180",
              "name": "محمود جمال محمد موسى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010199",
              "name": "ملك فراج صلاح الدين يونس احمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010222",
              "name": "يس ايمن محمد سيد محمود",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010229",
              "name": "يوسف محمد احمد يوسف محمد مهنا",
              "program": "الأمن السيبراني"
            }
          ]
        },
        {
          "id": "S1",
          "name": "سكشن 1 (S1)",
          "instructor": "م. ندى",
          "instructorId": "nada",
          "students": [
            {
              "id": "25010249",
              "name": "احمد عبد الحميد احمد محمود محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010250",
              "name": "احمد عبد الرحيم محمود احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010254",
              "name": "احمد عثمان مسعود ضيف",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010264",
              "name": "احمد ياسر على بدرى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010272",
              "name": "اشرف حسن محمد حسن",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010288",
              "name": "بلال إبراهيم خضرى إبراهيم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010295",
              "name": "تسنيم صلاح عبد الوهاب محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010302",
              "name": "حازم احمد حسين احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010304",
              "name": "حازم سعيد مصطفى عبد العليم مصطفى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010328",
              "name": "رايفن نشات عياد غبريال خله",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010362",
              "name": "شريف محمود إسماعيل محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010366",
              "name": "صفوان محمد النوبى احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010370",
              "name": "طارق علاء محمد عبد اللطيف",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010371",
              "name": "طلال حسن يوسف احمد عثمان",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010373",
              "name": "عبد الحميد احمد عبد الحميد محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010374",
              "name": "عبد الرحمن احمد رفاعى عبد الراضى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010388",
              "name": "عبد الله احمد فضل منوفى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010394",
              "name": "عبد الله فايد محمد إبراهيم محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010402",
              "name": "عمر إبراهيم عبد الكريم عبد الوهاب",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010403",
              "name": "عمر احمد جبريل امين",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010409",
              "name": "عمر محمد عبد السميع احمد محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010410",
              "name": "عمران محمود سعد يوسف",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010420",
              "name": "كاراس أيوب توفيق ذكرى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010443",
              "name": "محمد بدوى كمال بدوى الطاهر",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010451",
              "name": "محمد رفعت محمود عبد العال",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010480",
              "name": "محمود محمد على عبد العزيز",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010504",
              "name": "مصطفى محمد سعد عبد الجليل",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010031",
              "name": "اروه عادل جابر الأمير",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010045",
              "name": "ايمن عصام محمد حامد محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010051",
              "name": "بشار أبو الحسن محمود إسماعيل",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010060",
              "name": "حبيبه حسن احمد محمد احمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010152",
              "name": "محمد الشاذلى محمد جبريل",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010156",
              "name": "محمد حجاج محمد موسى",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010179",
              "name": "محمود احمد عبد العظيم عبد اللطيف",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010195",
              "name": "مصطفى محمد احمد العبد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010196",
              "name": "مصطفى هانى السيد محمد أبو سالم",
              "program": "الأمن السيبراني"
            }
          ]
        },
        {
          "id": "S3",
          "name": "سكشن 3 (S3)",
          "instructor": "م. ندى",
          "instructorId": "nada",
          "students": [
            {
              "id": "25010242",
              "name": "ابراهيم حسين إسماعيل محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010243",
              "name": "احمد السيد عباس محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010259",
              "name": "احمد محمد عز الدين على",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010234",
              "name": "أسماء جابر امين احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010238",
              "name": "أسماء سيد صحابى احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010273",
              "name": "الأسد أبو القاسم أبو المجد عرابى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010296",
              "name": "تسنيم عبد الناصر حسن أبو الوفا",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010309",
              "name": "حبيبه عادل الملك عبد الرحيم فريج",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010313",
              "name": "حبيبه محمود عبد العزيز إبراهيم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010321",
              "name": "خلود شاذلى عبد المعطى بربرى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010322",
              "name": "داليا عادل احمد مسعود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010329",
              "name": "رحمه طه رجب محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010332",
              "name": "رنا عبد السلام عبد الحميد متولى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010336",
              "name": "روضه صلاح محمد احمد جاد الله",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010345",
              "name": "زينب محمد خليل محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010367",
              "name": "صلاح الدين عاطف صلاح الدين زارع مراد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010377",
              "name": "عبد الرحمن جمال سليمان محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010386",
              "name": "عبد العظيم احمد عبد العظيم عثمان",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010399",
              "name": "علا منتصر احمد على احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010401",
              "name": "علياء عبد الناصر محمود عرابى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010412",
              "name": "عمرو عاطف محمد حسانى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010416",
              "name": "فاطمه عبد الهادى حفنى طه",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010422",
              "name": "كريم احمد حجاج محمد ابوزيد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010427",
              "name": "كيرلس شنوده بطرس عطا الله بشاى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010437",
              "name": "محمد احمد على محمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010457",
              "name": "محمد عزت جامع احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010467",
              "name": "محمد محمود محمد عبد الله عثمان",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010476",
              "name": "محمود صلاح محمود موسى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010483",
              "name": "مروان عبد الرحيم خليفه مبارك",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010492",
              "name": "مريم عصام عوض إسماعيل",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010510",
              "name": "منه الله على سعيد على",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010515",
              "name": "ندى طلعت محمد تميم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010535",
              "name": "يوسف رجب عبد الفتاح على",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010032",
              "name": "اروى حسن على عبد الله",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010035",
              "name": "اسراء صلاح سعد سعيد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010053",
              "name": "ثويبه على بكرى احمد على",
              "program": "الأمن السيبراني"
            }
          ]
        },
        {
          "id": "S5",
          "name": "سكشن 5 (S5)",
          "instructor": "م. ندى",
          "instructorId": "nada",
          "students": [
            {
              "id": "25010244",
              "name": "احمد النوبى محمد بغدادى عبد الرحمن",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010282",
              "name": "ايه سعيد مسلم فهيم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010290",
              "name": "بهاء الدين فنجرى سعدى حامد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010303",
              "name": "حازم احمد عطا على عثمان",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010307",
              "name": "حبيبه زكريا عبد اللاه محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010381",
              "name": "عبد الرحمن محسن محمد احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010385",
              "name": "عبد الرحيم محمد كامل سعيد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010387",
              "name": "عبد الله احمد عبد الحميد محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010391",
              "name": "عبد الله سعد عبد الله صديق إبراهيم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010393",
              "name": "عبد الله عمر محمد عوض إبراهيم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010400",
              "name": "على مجدى احمد عبد الجليل",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010411",
              "name": "عمرو دندراوى بشير دندراوى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010462",
              "name": "محمد كمال مصطفى حزين",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010473",
              "name": "محمود حاتم محمد عبد القادر",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010489",
              "name": "مريم بدوى محمود محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010498",
              "name": "مريم يوسف حامد محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010531",
              "name": "يوسف احمد يوسف محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010021",
              "name": "احمد عبود احمد محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010058",
              "name": "جوزيف عبد المسيح شحاته عبد النور",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010063",
              "name": "حسن احمد سعيد احمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010067",
              "name": "حور خالد محمد احمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010106",
              "name": "طه محمد طه احمد",
              "program": "الأمن السيبراني"
            }
          ]
        },
        {
          "id": "S9",
          "name": "سكشن 9 (S9)",
          "instructor": "م. ندى",
          "instructorId": "nada",
          "students": [
            {
              "id": "25010308",
              "name": "حبيبه زين العابدين احمد عبد العظيم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010317",
              "name": "حسين محمد سعد محمد حمود",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010323",
              "name": "داليا عبد الحليم احمد حفنى الطاهر",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010325",
              "name": "رؤيه ايمن محمد احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010334",
              "name": "روان محمد يوسف محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010338",
              "name": "ريم سيد طه إبراهيم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010342",
              "name": "زياد اشرف محمد حسن",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010349",
              "name": "ساره امين سانوسى امين",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010354",
              "name": "سمامحمود محمد عبد الواحد سالم",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010357",
              "name": "سندس عبد الصبور ربيع محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010541",
              "name": "عبد الرحمن اشرف محمد على سليمان",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010379",
              "name": "عبد الرحمن رجب محمد أحمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010405",
              "name": "عمر احمد محمد عبده",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010414",
              "name": "غاده محمود عبد اللطيف محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010415",
              "name": "فاطمه عبد الرؤوف محمد إبراهيم عبد الله",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010421",
              "name": "كرم احمد عباس محمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010430",
              "name": "مؤمن علاء عبد الرؤوف محمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010441",
              "name": "محمد ايمن محمد حسن",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010446",
              "name": "محمد حسين محمد حسين",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010447",
              "name": "محمد خالد أبو المجد رضوان",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010455",
              "name": "محمد صابر محمد مصري",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010459",
              "name": "محمد عصام محمد جمال مصطفى",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010469",
              "name": "محمد هيسم عبد العزيز إبراهيم سلامه",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010479",
              "name": "محمود محمد حشمت عوض الله",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010501",
              "name": "مصطفى احمد عبد السميع احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010505",
              "name": "معتز احمد عبد السميع احمد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010507",
              "name": "ملك ممدوح احمد يوسف",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010508",
              "name": "منه الله جمال الزهرى حسانين",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010514",
              "name": "نجوى محمد إبراهيم محمد نصار",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010517",
              "name": "نوران ايمن محمد حسان",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010533",
              "name": "يوسف ايمن رفاعى السيد",
              "program": "الذكاء الأصطناعى"
            },
            {
              "id": "25010059",
              "name": "حبيبه حسان عبد العاطى احمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010080",
              "name": "ريتاج صالحين احمد صالحين محمود",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010114",
              "name": "عبد الرحمن خالد إسماعيل محمود",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010148",
              "name": "مالك احمد فريد احمد",
              "program": "الأمن السيبراني"
            },
            {
              "id": "25010193",
              "name": "مصطفى رمضان محمود احمد",
              "program": "الأمن السيبراني"
            }
          ]
        }
      ],
      "instructors": [
        "ahmed",
        "engy",
        "nada"
      ]
    },
    {
      "id": "it_fundamentals",
      "name": "Introduction to IT Fundamentals",
      "nameAr": "أساسيات تكنولوجيا المعلومات",
      "instructors": [
        "engy",
        "nada"
      ],
      "groups": [
        {
          "id": "sec15",
          "name": "سكشن 15",
          "instructor": "م. إنجي",
          "instructorId": "engy",
          "students": [
            {
              "id": "IT1501",
              "name": "محمود حسين عبد العزيز احمد عبد العزيز",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1502",
              "name": "محمود خالد على سيد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1503",
              "name": "محمود صدقى احمد محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1504",
              "name": "محمود محمد عبد المقصود محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1505",
              "name": "محمود محمد عبد المنعم محمد عبد المنعم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1506",
              "name": "محمود محمد محمود محمد مكى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1507",
              "name": "محمود مصطفى عبد الاله سليم محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1508",
              "name": "مروان أبو الحجاج محمد السايح محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1509",
              "name": "مروان عبد الفتاح الحسانى الحسينى موسى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1510",
              "name": "مريم احمد حسن يسن حامد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1511",
              "name": "مريم اسامه رجاء نور",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1512",
              "name": "مريم السيد محمد كمال عبد العليم إبراهيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1513",
              "name": "مريم إبراهيم عبد الحكيم عبد العليم حسن",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1514",
              "name": "مريم حسن محمود دياب محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1515",
              "name": "مريم صابر توفيق صالح حسن",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1516",
              "name": "مريم على محمد حسان حمزه",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1517",
              "name": "مريم عمرو احمد عبد الحميد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1518",
              "name": "مريم محمد حمزه الراوى سالم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1519",
              "name": "مريم محمود عبد العاطى بسطاوى الدسوقى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1520",
              "name": "مصطفى المدثر عثمان محمد عثمان",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1521",
              "name": "مصطفى ايمن احمد محمود شرعان",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1522",
              "name": "مصطفى عبد القادر حسين محمود مهدى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1523",
              "name": "مصطفى محمود احمد تركى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1524",
              "name": "مصطفى منصور سعد محمد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1525",
              "name": "مصطفى يحى محمود احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1526",
              "name": "معاذ ايمن رمضان محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1527",
              "name": "معاذ حجاج عبد الفتاح منشاوى بكر",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1528",
              "name": "معاذ محمد فتحى احمد سيد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1529",
              "name": "معاذ مؤمن نجم الدين عبد الباقى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1530",
              "name": "معتز صالح محمد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1531",
              "name": "ملك احمد سيد مغازى احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1532",
              "name": "حسن حمدى تقى فليفل",
              "program": "الذكاء الاصطناعي"
            }
          ]
        },
        {
          "id": "sec17",
          "name": "سكشن 17",
          "instructor": "م. إنجي",
          "instructorId": "engy",
          "students": [
            {
              "id": "IT1701",
              "name": "هاجر اشرف محمد زيدان",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1702",
              "name": "هاجر محمد ثابت عبد الباسط",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1703",
              "name": "هاجر محمد حمزه سيد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1704",
              "name": "هاجر محمد عبيد زيدان",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1705",
              "name": "هاجر مصطفى عبده هنداوى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1706",
              "name": "هاله احمد عبد الرحمن محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1707",
              "name": "هدرا اكرم ناشد قرياقوس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1708",
              "name": "هدى احمد عسر عبد هللا",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1709",
              "name": "هدى عبد النبى احمد سليمان",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1710",
              "name": "هشام احمد فؤاد إبراهيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1711",
              "name": "هشام محمود هاشم محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1712",
              "name": "هنا احمد محمد حسين سنبل",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1713",
              "name": "هند عبد المنعم حسان احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1714",
              "name": "يارا رمضان احمد على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1715",
              "name": "ياسمين على عسران بصرى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1716",
              "name": "ياسين محمد عبد الحميد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1717",
              "name": "يحيى سيد حسن محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1718",
              "name": "يوسف احمد عبد العزيز احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1719",
              "name": "يوسف احمد عبد العزيز محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1720",
              "name": "يوسف إبراهيم خضارى على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1721",
              "name": "يوسف بدوى احمد محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1722",
              "name": "يوسف جمال محمد عبد العال",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1723",
              "name": "يوسف جهالن صديق جهالن",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1724",
              "name": "يوسف حسن فوزى الصاوى أبو زيد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1725",
              "name": "يوسف حسن يوسف إبراهيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1726",
              "name": "يوسف على محمد السيد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1727",
              "name": "يوسف محمد امام امام",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1728",
              "name": "يوسف محمد سعد عيد يوسف",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1729",
              "name": "يوسف محمد عبد الفتاح مبارك",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1730",
              "name": "يؤانا ايمن النوبى بخيت",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1731",
              "name": "مينا منصف حنا تاوضروس يوسف",
              "program": "الذكاء الاصطناعي"
            }
          ]
        },
        {
          "id": "sec8",
          "name": "سكشن 8",
          "instructor": "م. إنجي",
          "instructorId": "engy",
          "students": [
            {
              "id": "IT0801",
              "name": "احمد معتصم محمد عباس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0802",
              "name": "احمد هانى سيد احمد أبو المجد حسن",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0803",
              "name": "ادم عمر احمد الشاذلى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0804",
              "name": "ادهم عالء صالح عبد الشافى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0805",
              "name": "اريج احمد عبد الهادى بسطاوى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0806",
              "name": "اسراء شعبان صغير إبراهيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0807",
              "name": "اسالم عبد الحكيم يس على عمر",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0808",
              "name": "اكرم محمد عزيز مهدى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0809",
              "name": "االء احمد محمود قصد هللا",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0810",
              "name": "االء عبد القادر محمود محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0811",
              "name": "االء محمد عبده حامد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0812",
              "name": "الحسن سيد محمد قاسم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0813",
              "name": "الزهراء عبد الحليم احمد محمد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0814",
              "name": "السيد محمود السيد جيوشى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0815",
              "name": "الشيماء بتيتى محمد الملقب على محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0816",
              "name": "الفاروق سيد فاروق حسن عبد الرحيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0817",
              "name": "اليفيرا امجد ميشيل فلتاؤوس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0818",
              "name": "امل كرم خلف رسالن شمروخ",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0819",
              "name": "امير وجدى لويز ميخائيل",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0820",
              "name": "انجى نصرى نظير شنوده",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0821",
              "name": "اياد عبد الهادى محمود عرابى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0822",
              "name": "ايمان عبد الاله عبد الرحيم محمد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0823",
              "name": "ايه مصطفى طه محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0824",
              "name": "إبراهيم احمد عبد النبى يوسف",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0825",
              "name": "إبراهيم خلف فؤاد حموده",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0826",
              "name": "إبراهيم سمير حمزه إبراهيم عبد المنعم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0827",
              "name": "أبو الحجاج عدلى أبو الحجاج وهب هللا",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0828",
              "name": "أسماء اكرامى سيد احمد عواد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0829",
              "name": "أسماء رجب احمد عباس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0830",
              "name": "أسماء عبد العزيز محمد طه",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0831",
              "name": "باسم اسامه محمد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0832",
              "name": "بافلى نصرى يعقوب ضيف جوده",
              "program": "الذكاء الاصطناعي"
            }
          ]
        },
        {
          "id": "sec9",
          "name": "سكشن 9",
          "instructor": "م. إنجي",
          "instructorId": "engy",
          "students": [
            {
              "id": "IT0901",
              "name": "بريسكال ديفيد ظريف رياض محارب بولس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0902",
              "name": "بسمله أبو الحجاج محمود سعيد محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0903",
              "name": "بسنت احمد رمضان محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0904",
              "name": "بسنت الفى بساده لبيب عبد الشهيد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0905",
              "name": "بسنت محمود محمد الطاهر",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0906",
              "name": "بالل سيد محمد احمد إسماعيل",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0907",
              "name": "جاك تيتو وهيب جرجس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0908",
              "name": "جهاد احمد محمد عريان",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0909",
              "name": "جورج ممدوح نصيف اديب",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0910",
              "name": "جول سان محمد نجدى فراج ادم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0911",
              "name": "جومانا دسوقى محسب احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0912",
              "name": "جومانا عماد كمال عجيب",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0913",
              "name": "جيالن محمد طاهر جيالنى سالم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0914",
              "name": "حبيبه احمد عبد الغنى شاطر محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0915",
              "name": "حبيبه إبراهيم احمد محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0916",
              "name": "حبيبه سيد يوسف حسن",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0917",
              "name": "حبيبه طارق محمد السيد احمد عبد اللطيف",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0918",
              "name": "حبيبه عصام مصطفى على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0919",
              "name": "حبيبه عمر عبد النبى عبادى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0920",
              "name": "حسام عبد الناصر محمود احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0921",
              "name": "حسن النوبى عبد الجواد عبد العال حسن",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0922",
              "name": "حفصه عاطف أبو الحسن على محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0923",
              "name": "حفصه محمود سعيد سيد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0924",
              "name": "حمدى عالء صالح محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0925",
              "name": "حمزه عبد العاطى احمد على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0926",
              "name": "حنين ممدوح يسن بدرى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0927",
              "name": "خالد اشرف محمود محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0928",
              "name": "خالد عبد القادر جاد الكريم عبد الحميد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0929",
              "name": "خالد عبد المنعم عبد الراضى مصطفى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0930",
              "name": "خالد محمد احمد لبيب",
              "program": "الذكاء الاصطناعي"
            }
          ]
        },
        {
          "id": "sec10",
          "name": "سكشن 10",
          "instructor": "م. ندى",
          "instructorId": "nada",
          "students": [
            {
              "id": "IT1001",
              "name": "خالد محمد عبد الفتاح مبارك",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1002",
              "name": "احمد محمد وهبه الله محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1003",
              "name": "خباب عطا أبو المجد محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1004",
              "name": "خديجه حسين محمد النوبى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1005",
              "name": "داليا عربى حسن احمد عبد الرحيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1006",
              "name": "دعاء محمد احمد إسماعيل",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1007",
              "name": "ديفيد هانى مكرم شوربين",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1008",
              "name": "دينا اشرف شوقى نصير",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1009",
              "name": "دينا حمدى محمد مهران حامد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1010",
              "name": "راشد محمد جاد الكريم محمد حسن",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1011",
              "name": "رحمه جمال حسن إسماعيل",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1012",
              "name": "رحمه حاتم احمد بكرى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1013",
              "name": "رحمه محمود عبد الغنى عبد الواحد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1014",
              "name": "ردينه عمر حسن عكاشه",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1015",
              "name": "رزان عبد الحميد راشد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1016",
              "name": "رغد حجاج محمد احمد عمر",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1017",
              "name": "رغد ممدوح محمد أبو الحجاج حامد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1018",
              "name": "روضه احمد محمد معروف",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1019",
              "name": "رويدا محى الدين عبده محمود يوسف",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1020",
              "name": "ريتاج يوسف سعدى موسى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1021",
              "name": "رئام مصطفى احمد عبد الرحيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1022",
              "name": "زياد السعودى شحاته احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1023",
              "name": "زياد أبو السعود رضا عبد القادر",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1024",
              "name": "زياد حسين الغيطانى عبد النبى شلش",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1025",
              "name": "زياد محمود حسين توفيق",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1026",
              "name": "زياد ناصر كمال محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1027",
              "name": "زينب طواب عبد الموجود نوبى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1028",
              "name": "سامى صلاح محمد محجوب",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1029",
              "name": "ساندى سمير سعد الله عطيه",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1030",
              "name": "سعيد كمال صابر عبد المنعم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1031",
              "name": "ناردين أيوب نابيل فرج",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1032",
              "name": "ساره ضاحى فاروق قليعى محمد",
              "program": "الذكاء الاصطناعي"
            }
          ]
        },
        {
          "id": "sec13",
          "name": "سكشن 13",
          "instructor": "م. ندى",
          "instructorId": "nada",
          "students": [
            {
              "id": "IT1301",
              "name": "فاطمه محمود محمد دردير",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1302",
              "name": "فاطمه هانى محمود احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1303",
              "name": "فرجانى حسن محمد على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1304",
              "name": "فلوباتير حنا زخارى عبد المسيح",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1305",
              "name": "فهد مصطفى محمود النوبى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1306",
              "name": "فيلوباتير رافت انيس نسيم شحاته",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1307",
              "name": "كريم رجب عبد الحميد محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1308",
              "name": "كريم محمد صلاح محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1309",
              "name": "كريم محمود سعيد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1310",
              "name": "كيرلس ثروت فكرى حبيب",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1311",
              "name": "كيرلس رومانى شاكر زكى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1312",
              "name": "ماثيو ياسر عطا الكريم مريد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1313",
              "name": "مارتن اكرم سمير حنس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1314",
              "name": "مارتن رامى رشيد راغب مجلع",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1315",
              "name": "ماريا فايز حبيب إبراهيم متى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1316",
              "name": "ماريو ممدوح زاهر فخرى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1317",
              "name": "ماريو منصور عبد الله عبد الملاك",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1318",
              "name": "مازن ضياء الدين محمد سيد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1319",
              "name": "محمد احمد رضوان احمد جيلانى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1320",
              "name": "محمد احمد عابدين احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1321",
              "name": "محمد احمد عرفه عبد العزيز",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1322",
              "name": "محمد احمد فاروق احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1323",
              "name": "محمد اسامه إبراهيم محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1324",
              "name": "محمد الطيب احمد مطالب على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1325",
              "name": "محمد الطيب خضرى احمد محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1326",
              "name": "محمد الطيب محمد احمد كارم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1327",
              "name": "محمد ايمن حسن الأمير",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1328",
              "name": "محمد بس عبده عبد الحافظ",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1329",
              "name": "محمد حسين الأمير محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1330",
              "name": "محمد حمدى النوبى احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1331",
              "name": "محمد خالد على ابوالوفا",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1332",
              "name": "محمد خيرى محمد العادلى",
              "program": "الذكاء الاصطناعي"
            }
          ]
        },
        {
          "id": "sec16",
          "name": "سكشن 16",
          "instructor": "م. ندى",
          "instructorId": "nada",
          "students": [
            {
              "id": "IT1601",
              "name": "ملك الطاهراحمد الطاهر",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1602",
              "name": "ملك زكريا عبد السلام عشرى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1603",
              "name": "ملك على مرعى على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1604",
              "name": "ملك عمر محمد فندى عبد الباساط توفيق",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1605",
              "name": "ملك وائل عبد الرحيم عبد الحفيظ عبد المنعم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1606",
              "name": "منار بيومى محمد سعيد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1607",
              "name": "منه الله محمد عبد المريد دسوفى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1608",
              "name": "منه بركات محمد مرسى محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1609",
              "name": "منه عادل عطيتو على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1610",
              "name": "مهاب محمد محمود حميد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1611",
              "name": "مهند محمد حامد حجاجى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1612",
              "name": "مهند محمود منازع عبد الحميد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1613",
              "name": "مؤيد ياسر عبد المبدى توفيق",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1614",
              "name": "ميار حفنى محمد احمد حفنى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1615",
              "name": "ميار منصور على بدرى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1616",
              "name": "ميار وصفى احمد محمد حسنين",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1617",
              "name": "ميخائيل القس رافائيل عطا الله",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1618",
              "name": "ميرال محمد محى الدين محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1619",
              "name": "ميريت ايمن عدلى إبراهيم يوسف",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1620",
              "name": "ندى احمد العادلى على مكى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1621",
              "name": "ندى عبد الجواد عبد الراضى محمد على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1622",
              "name": "ندى عبد الخالق محمد احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1623",
              "name": "ندى محمد عبد الحليم محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1624",
              "name": "ندى محمود احمد عبد الراضى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1625",
              "name": "نهال مكرم عبد العزيز احمد محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1626",
              "name": "نور عادل حسين احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1627",
              "name": "نور عبد الباسط عبد السلام محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1628",
              "name": "نور محمد جابر عباس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1629",
              "name": "هاجر احمد بيومى منجود مرسى أبو على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1630",
              "name": "هاجر احمد عبد الحميد محمد عطيتو",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT1631",
              "name": "امينة ايمن محمد سيد محمود",
              "program": "الذكاء الاصطناعي"
            }
          ]
        },
        {
          "id": "sec3",
          "name": "سكشن 3",
          "instructor": "م. ندى",
          "instructorId": "nada",
          "students": [
            {
              "id": "IT0301",
              "name": "زياد كرم محمد حلمى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0302",
              "name": "زينب السيد احمد جلال",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0303",
              "name": "زينب محمد عبدالغنى محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0304",
              "name": "سارة احمد احمد البغدادى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0305",
              "name": "سارة طلعت عبدالمنطلب",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0306",
              "name": "ساره نبيه محفوظ ايوب",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0307",
              "name": "سلمى اسامه حماده عبده",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0308",
              "name": "سلمى محمد سيد بسيونى مصطفى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0309",
              "name": "سما فتح الله محمد فتح الله",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0310",
              "name": "سندرينا هانى عبد الله محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0311",
              "name": "سندس محمد مسلم احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0312",
              "name": "سيد احمد سيد كامل",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0313",
              "name": "سيف الإسلام محمد صلاح الدين",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0314",
              "name": "سيف الدين خالد محمد خيرى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0315",
              "name": "شهد جمال عبدالهادى محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0316",
              "name": "شهد طياب محمود عبدالجليل",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0317",
              "name": "شهد عادل إسماعيل على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0318",
              "name": "شهد محمد عبدالعاطى إبراهيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0319",
              "name": "صالح جعفر صالح محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0320",
              "name": "ضياء احمد حسن الجيلانى",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0321",
              "name": "طارق محمد دحيه يونس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0322",
              "name": "طه عبدالوهاب احمد طه",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0323",
              "name": "طه مبارك عبدالموجود محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0324",
              "name": "عبد الرحمن عامر محمد وداعة الله",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0325",
              "name": "عبدالرحمن محمد عبده على",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0326",
              "name": "عبدالرحمن محمد نجدى سيد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0327",
              "name": "عبدالله احمد محمد إبراهيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0328",
              "name": "عبدالله السيد عبداللاهى محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0329",
              "name": "عبدالله إبراهيم عيسى حسين",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0330",
              "name": "عبدالله إبراهيم محمد إبراهيم",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0331",
              "name": "عبدالله أبو القاسم ربيع إسماعيل",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0332",
              "name": "عبدالله حسن محمود احمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0333",
              "name": "عبدالله شحاته رضوان فارس",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0334",
              "name": "عبدالله محمد عبدالله محمد",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0335",
              "name": "عبدالله محمد كمال محمود",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0336",
              "name": "عبدالله وائل عبدالودود إسماعيل",
              "program": "الذكاء الاصطناعي"
            },
            {
              "id": "IT0337",
              "name": "على احمد عبدالفتاح على",
              "program": "الذكاء الاصطناعي"
            }
          ]
        }
      ]
    }
  ],
  "sessions": {
    "operating_systems_S15_w1": {
      "courseId": "operating_systems",
      "groupId": "S15",
      "week": "1",
      "date": "2026-10-01",
      "records": {
        "25010050": {
          "status": "present",
          "notes": ""
        },
        "25010072": {
          "status": "present",
          "notes": ""
        },
        "25010086": {
          "status": "present",
          "notes": ""
        },
        "25010088": {
          "status": "present",
          "notes": ""
        },
        "25010089": {
          "status": "present",
          "notes": ""
        },
        "25010105": {
          "status": "present",
          "notes": ""
        },
        "25010123": {
          "status": "present",
          "notes": ""
        },
        "25010126": {
          "status": "present",
          "notes": ""
        },
        "25010136": {
          "status": "present",
          "notes": ""
        },
        "25010139": {
          "status": "present",
          "notes": ""
        },
        "25010143": {
          "status": "present",
          "notes": ""
        },
        "25010149": {
          "status": "present",
          "notes": ""
        },
        "25010210": {
          "status": "present",
          "notes": ""
        },
        "25010214": {
          "status": "present",
          "notes": ""
        },
        "25010215": {
          "status": "present",
          "notes": ""
        },
        "25010227": {
          "status": "present",
          "notes": ""
        },
        "25010235": {
          "status": "present",
          "notes": ""
        },
        "25010258": {
          "status": "present",
          "notes": ""
        },
        "25010280": {
          "status": "present",
          "notes": ""
        },
        "25010287": {
          "status": "present",
          "notes": ""
        },
        "25010311": {
          "status": "present",
          "notes": ""
        },
        "25010312": {
          "status": "present",
          "notes": ""
        },
        "25010319": {
          "status": "present",
          "notes": ""
        },
        "25010344": {
          "status": "present",
          "notes": ""
        },
        "25010346": {
          "status": "present",
          "notes": ""
        },
        "25010419": {
          "status": "present",
          "notes": ""
        },
        "25010429": {
          "status": "present",
          "notes": ""
        },
        "25010433": {
          "status": "present",
          "notes": ""
        },
        "25010488": {
          "status": "present",
          "notes": ""
        },
        "25010493": {
          "status": "present",
          "notes": ""
        },
        "25010494": {
          "status": "present",
          "notes": ""
        },
        "25010496": {
          "status": "present",
          "notes": ""
        },
        "25010497": {
          "status": "present",
          "notes": ""
        },
        "25010503": {
          "status": "present",
          "notes": ""
        },
        "25010512": {
          "status": "present",
          "notes": ""
        },
        "25010522": {
          "status": "present",
          "notes": ""
        }
      },
      "updatedAt": "2026-10-01T10:00:00.000Z"
    },
    "operating_systems_S15_w2": {
      "courseId": "operating_systems",
      "groupId": "S15",
      "week": "2",
      "date": "2026-10-08",
      "records": {
        "25010050": {
          "status": "present",
          "notes": ""
        },
        "25010072": {
          "status": "present",
          "notes": ""
        },
        "25010086": {
          "status": "present",
          "notes": ""
        },
        "25010088": {
          "status": "present",
          "notes": ""
        },
        "25010089": {
          "status": "present",
          "notes": ""
        },
        "25010105": {
          "status": "present",
          "notes": ""
        },
        "25010123": {
          "status": "present",
          "notes": ""
        },
        "25010126": {
          "status": "present",
          "notes": ""
        },
        "25010136": {
          "status": "present",
          "notes": ""
        },
        "25010139": {
          "status": "present",
          "notes": ""
        },
        "25010143": {
          "status": "present",
          "notes": ""
        },
        "25010149": {
          "status": "present",
          "notes": ""
        },
        "25010210": {
          "status": "present",
          "notes": ""
        },
        "25010214": {
          "status": "present",
          "notes": ""
        },
        "25010215": {
          "status": "present",
          "notes": ""
        },
        "25010227": {
          "status": "present",
          "notes": ""
        },
        "25010235": {
          "status": "present",
          "notes": ""
        },
        "25010258": {
          "status": "present",
          "notes": ""
        },
        "25010280": {
          "status": "present",
          "notes": ""
        },
        "25010287": {
          "status": "present",
          "notes": ""
        },
        "25010311": {
          "status": "present",
          "notes": ""
        },
        "25010312": {
          "status": "present",
          "notes": ""
        },
        "25010319": {
          "status": "present",
          "notes": ""
        },
        "25010344": {
          "status": "present",
          "notes": ""
        },
        "25010346": {
          "status": "present",
          "notes": ""
        },
        "25010419": {
          "status": "present",
          "notes": ""
        },
        "25010429": {
          "status": "present",
          "notes": ""
        },
        "25010433": {
          "status": "present",
          "notes": ""
        },
        "25010488": {
          "status": "present",
          "notes": ""
        },
        "25010493": {
          "status": "present",
          "notes": ""
        },
        "25010494": {
          "status": "present",
          "notes": ""
        },
        "25010496": {
          "status": "present",
          "notes": ""
        },
        "25010497": {
          "status": "present",
          "notes": ""
        },
        "25010503": {
          "status": "present",
          "notes": ""
        },
        "25010512": {
          "status": "present",
          "notes": ""
        },
        "25010522": {
          "status": "present",
          "notes": ""
        }
      },
      "updatedAt": "2026-10-08T10:00:00.000Z"
    },
    "data_communication_GA_w1": {
      "courseId": "data_communication",
      "groupId": "GA",
      "week": "1",
      "date": "2026-09-23",
      "records": {
        "25010002": {
          "status": "absent",
          "notes": ""
        },
        "25010003": {
          "status": "present",
          "notes": ""
        },
        "25010009": {
          "status": "absent",
          "notes": ""
        },
        "25010014": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010021": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010023": {
          "status": "absent",
          "notes": ""
        },
        "25010031": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010032": {
          "status": "present",
          "notes": ""
        },
        "25010033": {
          "status": "present",
          "notes": ""
        },
        "25010034": {
          "status": "absent",
          "notes": ""
        },
        "25010035": {
          "status": "present",
          "notes": ""
        },
        "25010045": {
          "status": "absent",
          "notes": ""
        },
        "25010049": {
          "status": "present",
          "notes": ""
        },
        "25010051": {
          "status": "present",
          "notes": ""
        },
        "25010052": {
          "status": "absent",
          "notes": ""
        },
        "25010053": {
          "status": "present",
          "notes": ""
        },
        "25010054": {
          "status": "present",
          "notes": ""
        },
        "25010058": {
          "status": "absent",
          "notes": ""
        },
        "25010060": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010063": {
          "status": "absent",
          "notes": ""
        },
        "25010067": {
          "status": "absent",
          "notes": ""
        },
        "25010078": {
          "status": "absent",
          "notes": ""
        },
        "25010079": {
          "status": "absent",
          "notes": ""
        },
        "25010097": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010103": {
          "status": "present",
          "notes": ""
        },
        "25010106": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010112": {
          "status": "present",
          "notes": ""
        },
        "25010121": {
          "status": "absent",
          "notes": ""
        },
        "25010124": {
          "status": "absent",
          "notes": ""
        },
        "25010129": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010137": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010138": {
          "status": "absent",
          "notes": ""
        },
        "25010147": {
          "status": "present",
          "notes": ""
        },
        "25010152": {
          "status": "absent",
          "notes": ""
        },
        "25010156": {
          "status": "absent",
          "notes": ""
        },
        "25010170": {
          "status": "present",
          "notes": ""
        },
        "25010178": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010179": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010190": {
          "status": "present",
          "notes": ""
        },
        "25010191": {
          "status": "absent",
          "notes": ""
        },
        "25010192": {
          "status": "present",
          "notes": ""
        },
        "25010195": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010196": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010198": {
          "status": "present",
          "notes": ""
        },
        "25010217": {
          "status": "absent",
          "notes": ""
        },
        "25010223": {
          "status": "present",
          "notes": ""
        },
        "25010225": {
          "status": "present",
          "notes": ""
        },
        "25010234": {
          "status": "present",
          "notes": ""
        },
        "25010236": {
          "status": "present",
          "notes": ""
        },
        "25010237": {
          "status": "present",
          "notes": ""
        },
        "25010238": {
          "status": "present",
          "notes": ""
        },
        "25010239": {
          "status": "absent",
          "notes": ""
        },
        "25010242": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010243": {
          "status": "present",
          "notes": ""
        },
        "25010244": {
          "status": "absent",
          "notes": ""
        },
        "25010247": {
          "status": "present",
          "notes": ""
        },
        "25010249": {
          "status": "present",
          "notes": ""
        },
        "25010250": {
          "status": "absent",
          "notes": ""
        },
        "25010253": {
          "status": "absent",
          "notes": ""
        },
        "25010254": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010259": {
          "status": "present",
          "notes": ""
        },
        "25010261": {
          "status": "present",
          "notes": ""
        },
        "25010264": {
          "status": "absent",
          "notes": ""
        },
        "25010269": {
          "status": "present",
          "notes": ""
        },
        "25010272": {
          "status": "present",
          "notes": ""
        },
        "25010273": {
          "status": "present",
          "notes": ""
        },
        "25010275": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010282": {
          "status": "absent",
          "notes": ""
        },
        "25010283": {
          "status": "absent",
          "notes": ""
        },
        "25010286": {
          "status": "absent",
          "notes": ""
        },
        "25010288": {
          "status": "present",
          "notes": ""
        },
        "25010290": {
          "status": "present",
          "notes": ""
        },
        "25010291": {
          "status": "present",
          "notes": ""
        },
        "25010292": {
          "status": "absent",
          "notes": ""
        },
        "25010293": {
          "status": "absent",
          "notes": ""
        },
        "25010294": {
          "status": "absent",
          "notes": ""
        },
        "25010295": {
          "status": "present",
          "notes": ""
        },
        "25010296": {
          "status": "present",
          "notes": ""
        },
        "25010300": {
          "status": "absent",
          "notes": ""
        },
        "25010301": {
          "status": "present",
          "notes": ""
        },
        "25010302": {
          "status": "absent",
          "notes": ""
        },
        "25010303": {
          "status": "absent",
          "notes": ""
        },
        "25010304": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010307": {
          "status": "absent",
          "notes": ""
        },
        "25010309": {
          "status": "absent",
          "notes": ""
        },
        "25010310": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010313": {
          "status": "present",
          "notes": ""
        },
        "25010321": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010322": {
          "status": "present",
          "notes": ""
        },
        "25010327": {
          "status": "absent",
          "notes": ""
        },
        "25010328": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010329": {
          "status": "present",
          "notes": ""
        },
        "25010332": {
          "status": "present",
          "notes": ""
        },
        "25010336": {
          "status": "present",
          "notes": ""
        },
        "25010345": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010348": {
          "status": "absent",
          "notes": ""
        },
        "25010350": {
          "status": "present",
          "notes": ""
        },
        "25010353": {
          "status": "absent",
          "notes": ""
        },
        "25010359": {
          "status": "absent",
          "notes": ""
        },
        "25010362": {
          "status": "absent",
          "notes": ""
        },
        "25010364": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010366": {
          "status": "present",
          "notes": ""
        },
        "25010367": {
          "status": "present",
          "notes": ""
        },
        "25010370": {
          "status": "present",
          "notes": ""
        },
        "25010371": {
          "status": "absent",
          "notes": ""
        },
        "25010373": {
          "status": "present",
          "notes": ""
        },
        "25010374": {
          "status": "absent",
          "notes": ""
        },
        "25010377": {
          "status": "present",
          "notes": ""
        },
        "25010378": {
          "status": "present",
          "notes": ""
        },
        "25010381": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010385": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010386": {
          "status": "present",
          "notes": ""
        },
        "25010387": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010388": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010391": {
          "status": "absent",
          "notes": ""
        },
        "25010393": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010394": {
          "status": "absent",
          "notes": ""
        },
        "25010399": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010400": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010401": {
          "status": "present",
          "notes": ""
        },
        "25010402": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010403": {
          "status": "absent",
          "notes": ""
        },
        "25010409": {
          "status": "absent",
          "notes": ""
        },
        "25010410": {
          "status": "absent",
          "notes": ""
        },
        "25010411": {
          "status": "absent",
          "notes": ""
        },
        "25010412": {
          "status": "present",
          "notes": ""
        },
        "25010416": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010420": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010422": {
          "status": "present",
          "notes": ""
        },
        "25010427": {
          "status": "present",
          "notes": ""
        },
        "25010428": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010434": {
          "status": "present",
          "notes": ""
        },
        "25010437": {
          "status": "present",
          "notes": ""
        },
        "25010439": {
          "status": "absent",
          "notes": ""
        },
        "25010442": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010443": {
          "status": "present",
          "notes": ""
        },
        "25010451": {
          "status": "present",
          "notes": ""
        },
        "25010452": {
          "status": "absent",
          "notes": ""
        },
        "25010453": {
          "status": "absent",
          "notes": ""
        },
        "25010457": {
          "status": "present",
          "notes": ""
        },
        "25010462": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010467": {
          "status": "present",
          "notes": ""
        },
        "25010471": {
          "status": "absent",
          "notes": ""
        },
        "25010473": {
          "status": "absent",
          "notes": ""
        },
        "25010476": {
          "status": "present",
          "notes": ""
        },
        "25010480": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010481": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010483": {
          "status": "absent",
          "notes": ""
        },
        "25010484": {
          "status": "present",
          "notes": ""
        },
        "25010487": {
          "status": "present",
          "notes": ""
        },
        "25010489": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010492": {
          "status": "present",
          "notes": ""
        },
        "25010498": {
          "status": "present",
          "notes": ""
        },
        "25010499": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010502": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010504": {
          "status": "absent",
          "notes": ""
        },
        "25010510": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010515": {
          "status": "present",
          "notes": ""
        },
        "25010516": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010526": {
          "status": "present",
          "notes": ""
        },
        "25010528": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010531": {
          "status": "absent",
          "notes": ""
        },
        "25010535": {
          "status": "present",
          "notes": ""
        },
        "25010537": {
          "status": "absent",
          "notes": ""
        }
      },
      "updatedAt": "2026-09-23T12:00:00.000Z"
    },
    "data_communication_GA_w2": {
      "courseId": "data_communication",
      "groupId": "GA",
      "week": "2",
      "date": "2026-09-30",
      "records": {
        "25010002": {
          "status": "present",
          "notes": ""
        },
        "25010003": {
          "status": "present",
          "notes": ""
        },
        "25010009": {
          "status": "present",
          "notes": ""
        },
        "25010014": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010021": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010023": {
          "status": "absent",
          "notes": ""
        },
        "25010031": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010032": {
          "status": "present",
          "notes": ""
        },
        "25010033": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010034": {
          "status": "absent",
          "notes": ""
        },
        "25010035": {
          "status": "present",
          "notes": ""
        },
        "25010045": {
          "status": "present",
          "notes": ""
        },
        "25010049": {
          "status": "present",
          "notes": ""
        },
        "25010051": {
          "status": "present",
          "notes": ""
        },
        "25010052": {
          "status": "present",
          "notes": ""
        },
        "25010053": {
          "status": "present",
          "notes": ""
        },
        "25010054": {
          "status": "present",
          "notes": ""
        },
        "25010058": {
          "status": "absent",
          "notes": ""
        },
        "25010060": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب (حضرت مع Group B)"
        },
        "25010063": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010067": {
          "status": "absent",
          "notes": ""
        },
        "25010078": {
          "status": "absent",
          "notes": ""
        },
        "25010079": {
          "status": "absent",
          "notes": ""
        },
        "25010097": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010103": {
          "status": "present",
          "notes": ""
        },
        "25010106": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010112": {
          "status": "present",
          "notes": ""
        },
        "25010121": {
          "status": "absent",
          "notes": ""
        },
        "25010124": {
          "status": "present",
          "notes": ""
        },
        "25010129": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010137": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010138": {
          "status": "present",
          "notes": ""
        },
        "25010147": {
          "status": "present",
          "notes": ""
        },
        "25010152": {
          "status": "absent",
          "notes": ""
        },
        "25010156": {
          "status": "present",
          "notes": ""
        },
        "25010170": {
          "status": "present",
          "notes": ""
        },
        "25010178": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010179": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010190": {
          "status": "present",
          "notes": ""
        },
        "25010191": {
          "status": "present",
          "notes": ""
        },
        "25010192": {
          "status": "absent",
          "notes": ""
        },
        "25010195": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010196": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010198": {
          "status": "present",
          "notes": ""
        },
        "25010217": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010223": {
          "status": "present",
          "notes": ""
        },
        "25010225": {
          "status": "present",
          "notes": ""
        },
        "25010234": {
          "status": "present",
          "notes": ""
        },
        "25010236": {
          "status": "present",
          "notes": ""
        },
        "25010237": {
          "status": "present",
          "notes": ""
        },
        "25010238": {
          "status": "present",
          "notes": ""
        },
        "25010239": {
          "status": "present",
          "notes": ""
        },
        "25010242": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010243": {
          "status": "absent",
          "notes": ""
        },
        "25010244": {
          "status": "present",
          "notes": ""
        },
        "25010247": {
          "status": "present",
          "notes": ""
        },
        "25010249": {
          "status": "present",
          "notes": ""
        },
        "25010250": {
          "status": "present",
          "notes": ""
        },
        "25010253": {
          "status": "present",
          "notes": ""
        },
        "25010254": {
          "status": "present",
          "notes": ""
        },
        "25010259": {
          "status": "present",
          "notes": ""
        },
        "25010261": {
          "status": "present",
          "notes": ""
        },
        "25010264": {
          "status": "present",
          "notes": ""
        },
        "25010269": {
          "status": "present",
          "notes": ""
        },
        "25010272": {
          "status": "present",
          "notes": ""
        },
        "25010273": {
          "status": "present",
          "notes": ""
        },
        "25010275": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010282": {
          "status": "present",
          "notes": ""
        },
        "25010283": {
          "status": "absent",
          "notes": ""
        },
        "25010286": {
          "status": "absent",
          "notes": ""
        },
        "25010288": {
          "status": "present",
          "notes": ""
        },
        "25010290": {
          "status": "present",
          "notes": ""
        },
        "25010291": {
          "status": "present",
          "notes": ""
        },
        "25010292": {
          "status": "absent",
          "notes": ""
        },
        "25010293": {
          "status": "absent",
          "notes": ""
        },
        "25010294": {
          "status": "absent",
          "notes": ""
        },
        "25010295": {
          "status": "present",
          "notes": ""
        },
        "25010296": {
          "status": "present",
          "notes": ""
        },
        "25010300": {
          "status": "absent",
          "notes": ""
        },
        "25010301": {
          "status": "present",
          "notes": ""
        },
        "25010302": {
          "status": "present",
          "notes": ""
        },
        "25010303": {
          "status": "present",
          "notes": ""
        },
        "25010304": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010307": {
          "status": "present",
          "notes": ""
        },
        "25010309": {
          "status": "present",
          "notes": ""
        },
        "25010310": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010313": {
          "status": "present",
          "notes": ""
        },
        "25010321": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010322": {
          "status": "present",
          "notes": ""
        },
        "25010327": {
          "status": "present",
          "notes": ""
        },
        "25010328": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010329": {
          "status": "present",
          "notes": ""
        },
        "25010332": {
          "status": "present",
          "notes": ""
        },
        "25010336": {
          "status": "present",
          "notes": ""
        },
        "25010345": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010348": {
          "status": "present",
          "notes": ""
        },
        "25010350": {
          "status": "present",
          "notes": ""
        },
        "25010353": {
          "status": "present",
          "notes": ""
        },
        "25010359": {
          "status": "absent",
          "notes": ""
        },
        "25010362": {
          "status": "present",
          "notes": ""
        },
        "25010364": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010366": {
          "status": "present",
          "notes": ""
        },
        "25010367": {
          "status": "present",
          "notes": ""
        },
        "25010370": {
          "status": "present",
          "notes": ""
        },
        "25010371": {
          "status": "present",
          "notes": ""
        },
        "25010373": {
          "status": "present",
          "notes": ""
        },
        "25010374": {
          "status": "absent",
          "notes": ""
        },
        "25010377": {
          "status": "present",
          "notes": ""
        },
        "25010378": {
          "status": "present",
          "notes": ""
        },
        "25010381": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010385": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010386": {
          "status": "present",
          "notes": ""
        },
        "25010387": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010388": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010391": {
          "status": "present",
          "notes": ""
        },
        "25010393": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010394": {
          "status": "present",
          "notes": ""
        },
        "25010399": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010400": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010401": {
          "status": "present",
          "notes": ""
        },
        "25010402": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010403": {
          "status": "present",
          "notes": ""
        },
        "25010409": {
          "status": "present",
          "notes": ""
        },
        "25010410": {
          "status": "present",
          "notes": ""
        },
        "25010411": {
          "status": "absent",
          "notes": ""
        },
        "25010412": {
          "status": "present",
          "notes": ""
        },
        "25010416": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010420": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010422": {
          "status": "present",
          "notes": ""
        },
        "25010427": {
          "status": "present",
          "notes": ""
        },
        "25010428": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010434": {
          "status": "present",
          "notes": ""
        },
        "25010437": {
          "status": "present",
          "notes": ""
        },
        "25010439": {
          "status": "absent",
          "notes": ""
        },
        "25010442": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010443": {
          "status": "present",
          "notes": ""
        },
        "25010451": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010452": {
          "status": "present",
          "notes": ""
        },
        "25010453": {
          "status": "absent",
          "notes": ""
        },
        "25010457": {
          "status": "present",
          "notes": ""
        },
        "25010462": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010467": {
          "status": "present",
          "notes": ""
        },
        "25010471": {
          "status": "present",
          "notes": ""
        },
        "25010473": {
          "status": "absent",
          "notes": ""
        },
        "25010476": {
          "status": "present",
          "notes": ""
        },
        "25010480": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010481": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010483": {
          "status": "present",
          "notes": ""
        },
        "25010484": {
          "status": "present",
          "notes": ""
        },
        "25010487": {
          "status": "present",
          "notes": ""
        },
        "25010489": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010492": {
          "status": "present",
          "notes": ""
        },
        "25010498": {
          "status": "present",
          "notes": ""
        },
        "25010499": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010502": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010504": {
          "status": "absent",
          "notes": ""
        },
        "25010510": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010515": {
          "status": "present",
          "notes": ""
        },
        "25010516": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010526": {
          "status": "absent",
          "notes": ""
        },
        "25010528": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010531": {
          "status": "absent",
          "notes": ""
        },
        "25010535": {
          "status": "present",
          "notes": ""
        },
        "25010537": {
          "status": "present",
          "notes": ""
        }
      },
      "updatedAt": "2026-09-30T12:00:00.000Z"
    },
    "data_communication_GB_w1": {
      "courseId": "data_communication",
      "groupId": "GB",
      "week": "1",
      "date": "2026-09-23",
      "records": {
        "25010004": {
          "status": "present",
          "notes": ""
        },
        "25010008": {
          "status": "absent",
          "notes": ""
        },
        "25010010": {
          "status": "present",
          "notes": ""
        },
        "25010012": {
          "status": "absent",
          "notes": ""
        },
        "25010016": {
          "status": "present",
          "notes": ""
        },
        "25010018": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010019": {
          "status": "present",
          "notes": ""
        },
        "25010026": {
          "status": "present",
          "notes": ""
        },
        "25010029": {
          "status": "present",
          "notes": ""
        },
        "25010038": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010043": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010046": {
          "status": "absent",
          "notes": ""
        },
        "25010047": {
          "status": "present",
          "notes": ""
        },
        "25010055": {
          "status": "absent",
          "notes": ""
        },
        "25010057": {
          "status": "absent",
          "notes": ""
        },
        "25010059": {
          "status": "present",
          "notes": ""
        },
        "25010061": {
          "status": "present",
          "notes": ""
        },
        "25010065": {
          "status": "present",
          "notes": ""
        },
        "25010070": {
          "status": "absent",
          "notes": ""
        },
        "25010080": {
          "status": "present",
          "notes": ""
        },
        "25010081": {
          "status": "absent",
          "notes": ""
        },
        "25010082": {
          "status": "absent",
          "notes": ""
        },
        "25010084": {
          "status": "present",
          "notes": ""
        },
        "25010095": {
          "status": "absent",
          "notes": ""
        },
        "25010096": {
          "status": "absent",
          "notes": ""
        },
        "25010100": {
          "status": "present",
          "notes": ""
        },
        "25010107": {
          "status": "absent",
          "notes": ""
        },
        "25010110": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010113": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010114": {
          "status": "present",
          "notes": ""
        },
        "25010130": {
          "status": "absent",
          "notes": ""
        },
        "25010141": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010144": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010145": {
          "status": "present",
          "notes": ""
        },
        "25010146": {
          "status": "absent",
          "notes": ""
        },
        "25010148": {
          "status": "present",
          "notes": ""
        },
        "25010150": {
          "status": "present",
          "notes": ""
        },
        "25010153": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010155": {
          "status": "absent",
          "notes": ""
        },
        "25010158": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010160": {
          "status": "absent",
          "notes": ""
        },
        "25010161": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010162": {
          "status": "absent",
          "notes": ""
        },
        "25010168": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010172": {
          "status": "present",
          "notes": ""
        },
        "25010173": {
          "status": "absent",
          "notes": ""
        },
        "25010174": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010177": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010180": {
          "status": "present",
          "notes": ""
        },
        "25010187": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010188": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010189": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010193": {
          "status": "present",
          "notes": ""
        },
        "25010199": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010201": {
          "status": "absent",
          "notes": ""
        },
        "25010202": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010218": {
          "status": "absent",
          "notes": ""
        },
        "25010220": {
          "status": "absent",
          "notes": ""
        },
        "25010221": {
          "status": "present",
          "notes": ""
        },
        "25010222": {
          "status": "absent",
          "notes": ""
        },
        "25010228": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010229": {
          "status": "present",
          "notes": ""
        },
        "25010233": {
          "status": "present",
          "notes": ""
        },
        "25010246": {
          "status": "absent",
          "notes": ""
        },
        "25010248": {
          "status": "present",
          "notes": ""
        },
        "25010251": {
          "status": "present",
          "notes": ""
        },
        "25010263": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010267": {
          "status": "present",
          "notes": ""
        },
        "25010276": {
          "status": "present",
          "notes": ""
        },
        "25010277": {
          "status": "absent",
          "notes": ""
        },
        "25010281": {
          "status": "absent",
          "notes": ""
        },
        "25010284": {
          "status": "absent",
          "notes": ""
        },
        "25010285": {
          "status": "present",
          "notes": ""
        },
        "25010308": {
          "status": "present",
          "notes": ""
        },
        "25010317": {
          "status": "present",
          "notes": ""
        },
        "25010323": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010325": {
          "status": "present",
          "notes": ""
        },
        "25010334": {
          "status": "absent",
          "notes": ""
        },
        "25010338": {
          "status": "absent",
          "notes": ""
        },
        "25010339": {
          "status": "present",
          "notes": ""
        },
        "25010342": {
          "status": "present",
          "notes": ""
        },
        "25010349": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010351": {
          "status": "present",
          "notes": ""
        },
        "25010354": {
          "status": "absent",
          "notes": ""
        },
        "25010356": {
          "status": "absent",
          "notes": ""
        },
        "25010357": {
          "status": "absent",
          "notes": ""
        },
        "25010358": {
          "status": "absent",
          "notes": ""
        },
        "25010360": {
          "status": "present",
          "notes": ""
        },
        "25010363": {
          "status": "present",
          "notes": ""
        },
        "25010368": {
          "status": "present",
          "notes": ""
        },
        "25010379": {
          "status": "present",
          "notes": ""
        },
        "25010380": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010383": {
          "status": "present",
          "notes": ""
        },
        "25010384": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010389": {
          "status": "absent",
          "notes": ""
        },
        "25010395": {
          "status": "absent",
          "notes": ""
        },
        "25010398": {
          "status": "absent",
          "notes": ""
        },
        "25010404": {
          "status": "present",
          "notes": ""
        },
        "25010405": {
          "status": "present",
          "notes": ""
        },
        "25010406": {
          "status": "present",
          "notes": ""
        },
        "25010408": {
          "status": "present",
          "notes": ""
        },
        "25010414": {
          "status": "present",
          "notes": ""
        },
        "25010415": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010418": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010421": {
          "status": "absent",
          "notes": ""
        },
        "25010424": {
          "status": "absent",
          "notes": ""
        },
        "25010430": {
          "status": "present",
          "notes": ""
        },
        "25010431": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010435": {
          "status": "absent",
          "notes": ""
        },
        "25010436": {
          "status": "absent",
          "notes": ""
        },
        "25010440": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010441": {
          "status": "present",
          "notes": ""
        },
        "25010444": {
          "status": "absent",
          "notes": ""
        },
        "25010445": {
          "status": "absent",
          "notes": ""
        },
        "25010446": {
          "status": "present",
          "notes": ""
        },
        "25010447": {
          "status": "present",
          "notes": ""
        },
        "25010448": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010454": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010455": {
          "status": "absent",
          "notes": ""
        },
        "25010459": {
          "status": "present",
          "notes": ""
        },
        "25010469": {
          "status": "absent",
          "notes": ""
        },
        "25010479": {
          "status": "present",
          "notes": ""
        },
        "25010491": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010500": {
          "status": "absent",
          "notes": ""
        },
        "25010501": {
          "status": "present",
          "notes": ""
        },
        "25010505": {
          "status": "present",
          "notes": ""
        },
        "25010507": {
          "status": "present",
          "notes": ""
        },
        "25010508": {
          "status": "present",
          "notes": ""
        },
        "25010509": {
          "status": "absent",
          "notes": ""
        },
        "25010513": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010514": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010517": {
          "status": "present",
          "notes": ""
        },
        "25010527": {
          "status": "absent",
          "notes": ""
        },
        "25010530": {
          "status": "present",
          "notes": ""
        },
        "25010532": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010533": {
          "status": "present",
          "notes": ""
        },
        "25010534": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010538": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010539": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010540": {
          "status": "present",
          "notes": ""
        },
        "25010541": {
          "status": "present",
          "notes": ""
        },
        "25010542": {
          "status": "present",
          "notes": ""
        }
      },
      "updatedAt": "2026-09-23T12:00:00.000Z"
    },
    "data_communication_GB_w2": {
      "courseId": "data_communication",
      "groupId": "GB",
      "week": "2",
      "date": "2026-09-30",
      "records": {
        "25010004": {
          "status": "absent",
          "notes": ""
        },
        "25010008": {
          "status": "absent",
          "notes": ""
        },
        "25010010": {
          "status": "present",
          "notes": ""
        },
        "25010012": {
          "status": "present",
          "notes": ""
        },
        "25010016": {
          "status": "present",
          "notes": ""
        },
        "25010018": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010019": {
          "status": "present",
          "notes": ""
        },
        "25010026": {
          "status": "present",
          "notes": ""
        },
        "25010029": {
          "status": "present",
          "notes": ""
        },
        "25010038": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010043": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010046": {
          "status": "present",
          "notes": ""
        },
        "25010047": {
          "status": "present",
          "notes": ""
        },
        "25010055": {
          "status": "absent",
          "notes": ""
        },
        "25010057": {
          "status": "absent",
          "notes": ""
        },
        "25010059": {
          "status": "absent",
          "notes": ""
        },
        "25010061": {
          "status": "present",
          "notes": ""
        },
        "25010065": {
          "status": "absent",
          "notes": ""
        },
        "25010070": {
          "status": "present",
          "notes": ""
        },
        "25010080": {
          "status": "absent",
          "notes": ""
        },
        "25010081": {
          "status": "absent",
          "notes": ""
        },
        "25010082": {
          "status": "absent",
          "notes": ""
        },
        "25010084": {
          "status": "present",
          "notes": ""
        },
        "25010095": {
          "status": "absent",
          "notes": ""
        },
        "25010096": {
          "status": "absent",
          "notes": ""
        },
        "25010100": {
          "status": "present",
          "notes": ""
        },
        "25010107": {
          "status": "present",
          "notes": ""
        },
        "25010110": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010113": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010114": {
          "status": "present",
          "notes": ""
        },
        "25010130": {
          "status": "absent",
          "notes": ""
        },
        "25010141": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010144": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010145": {
          "status": "present",
          "notes": ""
        },
        "25010146": {
          "status": "absent",
          "notes": ""
        },
        "25010148": {
          "status": "present",
          "notes": ""
        },
        "25010150": {
          "status": "present",
          "notes": ""
        },
        "25010153": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010155": {
          "status": "present",
          "notes": ""
        },
        "25010158": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010160": {
          "status": "absent",
          "notes": ""
        },
        "25010161": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010162": {
          "status": "absent",
          "notes": ""
        },
        "25010168": {
          "status": "present",
          "notes": ""
        },
        "25010172": {
          "status": "present",
          "notes": ""
        },
        "25010173": {
          "status": "present",
          "notes": ""
        },
        "25010174": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010177": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010180": {
          "status": "present",
          "notes": ""
        },
        "25010187": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010188": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010189": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010193": {
          "status": "present",
          "notes": ""
        },
        "25010199": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010201": {
          "status": "absent",
          "notes": ""
        },
        "25010202": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010218": {
          "status": "present",
          "notes": ""
        },
        "25010220": {
          "status": "absent",
          "notes": ""
        },
        "25010221": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010222": {
          "status": "absent",
          "notes": ""
        },
        "25010228": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010229": {
          "status": "present",
          "notes": ""
        },
        "25010233": {
          "status": "present",
          "notes": ""
        },
        "25010246": {
          "status": "absent",
          "notes": ""
        },
        "25010248": {
          "status": "present",
          "notes": ""
        },
        "25010251": {
          "status": "present",
          "notes": ""
        },
        "25010263": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010267": {
          "status": "present",
          "notes": ""
        },
        "25010276": {
          "status": "absent",
          "notes": ""
        },
        "25010277": {
          "status": "present",
          "notes": ""
        },
        "25010281": {
          "status": "present",
          "notes": ""
        },
        "25010284": {
          "status": "present",
          "notes": ""
        },
        "25010285": {
          "status": "present",
          "notes": ""
        },
        "25010308": {
          "status": "present",
          "notes": ""
        },
        "25010317": {
          "status": "present",
          "notes": ""
        },
        "25010323": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010325": {
          "status": "present",
          "notes": ""
        },
        "25010334": {
          "status": "present",
          "notes": ""
        },
        "25010338": {
          "status": "present",
          "notes": ""
        },
        "25010339": {
          "status": "present",
          "notes": ""
        },
        "25010342": {
          "status": "present",
          "notes": ""
        },
        "25010349": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010351": {
          "status": "present",
          "notes": ""
        },
        "25010354": {
          "status": "present",
          "notes": ""
        },
        "25010356": {
          "status": "present",
          "notes": ""
        },
        "25010357": {
          "status": "present",
          "notes": ""
        },
        "25010358": {
          "status": "present",
          "notes": ""
        },
        "25010360": {
          "status": "present",
          "notes": ""
        },
        "25010363": {
          "status": "present",
          "notes": ""
        },
        "25010368": {
          "status": "present",
          "notes": ""
        },
        "25010379": {
          "status": "present",
          "notes": ""
        },
        "25010380": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010383": {
          "status": "present",
          "notes": ""
        },
        "25010384": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010389": {
          "status": "absent",
          "notes": ""
        },
        "25010395": {
          "status": "absent",
          "notes": ""
        },
        "25010398": {
          "status": "absent",
          "notes": ""
        },
        "25010404": {
          "status": "present",
          "notes": ""
        },
        "25010405": {
          "status": "present",
          "notes": ""
        },
        "25010406": {
          "status": "present",
          "notes": ""
        },
        "25010408": {
          "status": "absent",
          "notes": ""
        },
        "25010414": {
          "status": "present",
          "notes": ""
        },
        "25010415": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010418": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010421": {
          "status": "present",
          "notes": ""
        },
        "25010424": {
          "status": "absent",
          "notes": ""
        },
        "25010430": {
          "status": "present",
          "notes": ""
        },
        "25010431": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010435": {
          "status": "absent",
          "notes": ""
        },
        "25010436": {
          "status": "absent",
          "notes": ""
        },
        "25010440": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010441": {
          "status": "absent",
          "notes": ""
        },
        "25010444": {
          "status": "present",
          "notes": ""
        },
        "25010445": {
          "status": "absent",
          "notes": ""
        },
        "25010446": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010447": {
          "status": "present",
          "notes": ""
        },
        "25010448": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010454": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010455": {
          "status": "absent",
          "notes": ""
        },
        "25010459": {
          "status": "present",
          "notes": ""
        },
        "25010469": {
          "status": "present",
          "notes": ""
        },
        "25010479": {
          "status": "present",
          "notes": ""
        },
        "25010491": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010500": {
          "status": "absent",
          "notes": ""
        },
        "25010501": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010505": {
          "status": "present",
          "notes": ""
        },
        "25010507": {
          "status": "present",
          "notes": ""
        },
        "25010508": {
          "status": "present",
          "notes": ""
        },
        "25010509": {
          "status": "present",
          "notes": ""
        },
        "25010513": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010514": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010517": {
          "status": "present",
          "notes": ""
        },
        "25010527": {
          "status": "absent",
          "notes": ""
        },
        "25010530": {
          "status": "present",
          "notes": ""
        },
        "25010532": {
          "status": "present",
          "notes": ""
        },
        "25010533": {
          "status": "present",
          "notes": ""
        },
        "25010534": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010538": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010539": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010540": {
          "status": "present",
          "notes": ""
        },
        "25010541": {
          "status": "present",
          "notes": ""
        },
        "25010542": {
          "status": "present",
          "notes": ""
        }
      },
      "updatedAt": "2026-09-30T12:00:00.000Z"
    },
    "data_communication_GC_w1": {
      "courseId": "data_communication",
      "groupId": "GC",
      "week": "1",
      "date": "2026-09-23",
      "records": {
        "25010001": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010005": {
          "status": "present",
          "notes": ""
        },
        "25010006": {
          "status": "present",
          "notes": ""
        },
        "25010007": {
          "status": "absent",
          "notes": ""
        },
        "25010011": {
          "status": "present",
          "notes": ""
        },
        "25010013": {
          "status": "present",
          "notes": ""
        },
        "25010020": {
          "status": "absent",
          "notes": ""
        },
        "25010024": {
          "status": "present",
          "notes": ""
        },
        "25010025": {
          "status": "absent",
          "notes": ""
        },
        "25010027": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010036": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010039": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010040": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010042": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010044": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010048": {
          "status": "present",
          "notes": ""
        },
        "25010050": {
          "status": "present",
          "notes": ""
        },
        "25010056": {
          "status": "absent",
          "notes": ""
        },
        "25010062": {
          "status": "present",
          "notes": ""
        },
        "25010064": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010066": {
          "status": "present",
          "notes": ""
        },
        "25010068": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010069": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010071": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010072": {
          "status": "present",
          "notes": ""
        },
        "25010073": {
          "status": "present",
          "notes": ""
        },
        "25010075": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010076": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010077": {
          "status": "present",
          "notes": ""
        },
        "25010086": {
          "status": "present",
          "notes": ""
        },
        "25010087": {
          "status": "present",
          "notes": ""
        },
        "25010088": {
          "status": "present",
          "notes": ""
        },
        "25010089": {
          "status": "present",
          "notes": ""
        },
        "25010091": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010092": {
          "status": "present",
          "notes": ""
        },
        "25010094": {
          "status": "present",
          "notes": ""
        },
        "25010101": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010102": {
          "status": "absent",
          "notes": ""
        },
        "25010104": {
          "status": "present",
          "notes": ""
        },
        "25010105": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010108": {
          "status": "present",
          "notes": ""
        },
        "25010109": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010115": {
          "status": "absent",
          "notes": ""
        },
        "25010116": {
          "status": "present",
          "notes": ""
        },
        "25010117": {
          "status": "present",
          "notes": ""
        },
        "25010118": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010119": {
          "status": "present",
          "notes": ""
        },
        "25010122": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010123": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010126": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010127": {
          "status": "absent",
          "notes": ""
        },
        "25010128": {
          "status": "present",
          "notes": ""
        },
        "25010131": {
          "status": "present",
          "notes": ""
        },
        "25010132": {
          "status": "present",
          "notes": ""
        },
        "25010133": {
          "status": "present",
          "notes": ""
        },
        "25010135": {
          "status": "present",
          "notes": ""
        },
        "25010136": {
          "status": "present",
          "notes": ""
        },
        "25010139": {
          "status": "present",
          "notes": ""
        },
        "25010142": {
          "status": "present",
          "notes": ""
        },
        "25010143": {
          "status": "present",
          "notes": ""
        },
        "25010149": {
          "status": "present",
          "notes": ""
        },
        "25010154": {
          "status": "present",
          "notes": ""
        },
        "25010159": {
          "status": "absent",
          "notes": ""
        },
        "25010163": {
          "status": "present",
          "notes": ""
        },
        "25010164": {
          "status": "present",
          "notes": ""
        },
        "25010165": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010167": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010169": {
          "status": "present",
          "notes": ""
        },
        "25010171": {
          "status": "present",
          "notes": ""
        },
        "25010175": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010182": {
          "status": "present",
          "notes": ""
        },
        "25010184": {
          "status": "present",
          "notes": ""
        },
        "25010185": {
          "status": "present",
          "notes": ""
        },
        "25010186": {
          "status": "present",
          "notes": ""
        },
        "25010194": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010197": {
          "status": "present",
          "notes": ""
        },
        "25010200": {
          "status": "present",
          "notes": ""
        },
        "25010203": {
          "status": "present",
          "notes": ""
        },
        "25010204": {
          "status": "present",
          "notes": ""
        },
        "25010205": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010207": {
          "status": "present",
          "notes": ""
        },
        "25010209": {
          "status": "present",
          "notes": ""
        },
        "25010210": {
          "status": "present",
          "notes": ""
        },
        "25010211": {
          "status": "present",
          "notes": ""
        },
        "25010213": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010214": {
          "status": "absent",
          "notes": ""
        },
        "25010215": {
          "status": "absent",
          "notes": ""
        },
        "25010216": {
          "status": "present",
          "notes": ""
        },
        "25010219": {
          "status": "absent",
          "notes": ""
        },
        "25010227": {
          "status": "present",
          "notes": ""
        },
        "25010231": {
          "status": "absent",
          "notes": ""
        },
        "25010232": {
          "status": "absent",
          "notes": ""
        },
        "25010235": {
          "status": "absent",
          "notes": ""
        },
        "25010245": {
          "status": "present",
          "notes": ""
        },
        "25010255": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010256": {
          "status": "present",
          "notes": ""
        },
        "25010258": {
          "status": "absent",
          "notes": ""
        },
        "25010265": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010266": {
          "status": "present",
          "notes": ""
        },
        "25010268": {
          "status": "absent",
          "notes": ""
        },
        "25010270": {
          "status": "present",
          "notes": ""
        },
        "25010271": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010274": {
          "status": "absent",
          "notes": ""
        },
        "25010278": {
          "status": "absent",
          "notes": ""
        },
        "25010279": {
          "status": "present",
          "notes": ""
        },
        "25010280": {
          "status": "present",
          "notes": ""
        },
        "25010287": {
          "status": "present",
          "notes": ""
        },
        "25010289": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010298": {
          "status": "absent",
          "notes": ""
        },
        "25010299": {
          "status": "absent",
          "notes": ""
        },
        "25010305": {
          "status": "present",
          "notes": ""
        },
        "25010306": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010311": {
          "status": "present",
          "notes": ""
        },
        "25010312": {
          "status": "present",
          "notes": ""
        },
        "25010315": {
          "status": "present",
          "notes": ""
        },
        "25010318": {
          "status": "present",
          "notes": ""
        },
        "25010319": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010320": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010324": {
          "status": "present",
          "notes": ""
        },
        "25010326": {
          "status": "present",
          "notes": ""
        },
        "25010330": {
          "status": "present",
          "notes": ""
        },
        "25010331": {
          "status": "present",
          "notes": ""
        },
        "25010335": {
          "status": "absent",
          "notes": ""
        },
        "25010337": {
          "status": "absent",
          "notes": ""
        },
        "25010340": {
          "status": "absent",
          "notes": ""
        },
        "25010341": {
          "status": "present",
          "notes": ""
        },
        "25010343": {
          "status": "present",
          "notes": ""
        },
        "25010344": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010346": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010347": {
          "status": "present",
          "notes": ""
        },
        "25010352": {
          "status": "present",
          "notes": ""
        },
        "25010355": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010365": {
          "status": "present",
          "notes": ""
        },
        "25010372": {
          "status": "present",
          "notes": ""
        },
        "25010376": {
          "status": "present",
          "notes": ""
        },
        "25010392": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010396": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010397": {
          "status": "present",
          "notes": ""
        },
        "25010407": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010413": {
          "status": "present",
          "notes": ""
        },
        "25010417": {
          "status": "present",
          "notes": ""
        },
        "25010419": {
          "status": "present",
          "notes": ""
        },
        "25010423": {
          "status": "present",
          "notes": ""
        },
        "25010426": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010429": {
          "status": "present",
          "notes": ""
        },
        "25010432": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010433": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010438": {
          "status": "present",
          "notes": ""
        },
        "25010449": {
          "status": "present",
          "notes": ""
        },
        "25010450": {
          "status": "present",
          "notes": ""
        },
        "25010456": {
          "status": "present",
          "notes": ""
        },
        "25010458": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010460": {
          "status": "present",
          "notes": ""
        },
        "25010464": {
          "status": "present",
          "notes": ""
        },
        "25010466": {
          "status": "present",
          "notes": ""
        },
        "25010468": {
          "status": "absent",
          "notes": ""
        },
        "25010472": {
          "status": "present",
          "notes": ""
        },
        "25010474": {
          "status": "absent",
          "notes": ""
        },
        "25010478": {
          "status": "present",
          "notes": ""
        },
        "25010482": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010485": {
          "status": "present",
          "notes": ""
        },
        "25010486": {
          "status": "present",
          "notes": ""
        },
        "25010488": {
          "status": "present",
          "notes": ""
        },
        "25010493": {
          "status": "present",
          "notes": ""
        },
        "25010494": {
          "status": "present",
          "notes": ""
        },
        "25010495": {
          "status": "present",
          "notes": ""
        },
        "25010496": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010497": {
          "status": "absent",
          "notes": ""
        },
        "25010503": {
          "status": "present",
          "notes": ""
        },
        "25010506": {
          "status": "present",
          "notes": ""
        },
        "25010512": {
          "status": "absent",
          "notes": ""
        },
        "25010518": {
          "status": "present",
          "notes": ""
        },
        "25010521": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010522": {
          "status": "absent",
          "notes": ""
        },
        "25010523": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010524": {
          "status": "present",
          "notes": ""
        },
        "25010525": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010529": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010536": {
          "status": "present",
          "notes": ""
        }
      },
      "updatedAt": "2026-09-23T12:00:00.000Z"
    },
    "data_communication_GC_w2": {
      "courseId": "data_communication",
      "groupId": "GC",
      "week": "2",
      "date": "2026-09-30",
      "records": {
        "25010001": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010005": {
          "status": "present",
          "notes": ""
        },
        "25010006": {
          "status": "present",
          "notes": ""
        },
        "25010007": {
          "status": "absent",
          "notes": ""
        },
        "25010011": {
          "status": "present",
          "notes": ""
        },
        "25010013": {
          "status": "present",
          "notes": ""
        },
        "25010020": {
          "status": "present",
          "notes": ""
        },
        "25010024": {
          "status": "present",
          "notes": ""
        },
        "25010025": {
          "status": "present",
          "notes": ""
        },
        "25010027": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010036": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010039": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010040": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010042": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010044": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010048": {
          "status": "present",
          "notes": ""
        },
        "25010050": {
          "status": "present",
          "notes": ""
        },
        "25010056": {
          "status": "absent",
          "notes": ""
        },
        "25010062": {
          "status": "present",
          "notes": ""
        },
        "25010064": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010066": {
          "status": "present",
          "notes": ""
        },
        "25010068": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010069": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010071": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010072": {
          "status": "present",
          "notes": ""
        },
        "25010073": {
          "status": "present",
          "notes": ""
        },
        "25010075": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010076": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010077": {
          "status": "present",
          "notes": ""
        },
        "25010086": {
          "status": "present",
          "notes": ""
        },
        "25010087": {
          "status": "present",
          "notes": ""
        },
        "25010088": {
          "status": "present",
          "notes": ""
        },
        "25010089": {
          "status": "present",
          "notes": ""
        },
        "25010091": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010092": {
          "status": "present",
          "notes": ""
        },
        "25010094": {
          "status": "present",
          "notes": ""
        },
        "25010101": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010102": {
          "status": "present",
          "notes": ""
        },
        "25010104": {
          "status": "present",
          "notes": ""
        },
        "25010105": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010108": {
          "status": "present",
          "notes": ""
        },
        "25010109": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010115": {
          "status": "present",
          "notes": ""
        },
        "25010116": {
          "status": "present",
          "notes": ""
        },
        "25010117": {
          "status": "present",
          "notes": ""
        },
        "25010118": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010119": {
          "status": "present",
          "notes": ""
        },
        "25010122": {
          "status": "present",
          "notes": ""
        },
        "25010123": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010126": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010127": {
          "status": "present",
          "notes": ""
        },
        "25010128": {
          "status": "present",
          "notes": ""
        },
        "25010131": {
          "status": "present",
          "notes": ""
        },
        "25010132": {
          "status": "present",
          "notes": ""
        },
        "25010133": {
          "status": "present",
          "notes": ""
        },
        "25010135": {
          "status": "present",
          "notes": ""
        },
        "25010136": {
          "status": "present",
          "notes": ""
        },
        "25010139": {
          "status": "present",
          "notes": ""
        },
        "25010142": {
          "status": "present",
          "notes": ""
        },
        "25010143": {
          "status": "present",
          "notes": ""
        },
        "25010149": {
          "status": "present",
          "notes": ""
        },
        "25010154": {
          "status": "present",
          "notes": ""
        },
        "25010159": {
          "status": "present",
          "notes": ""
        },
        "25010163": {
          "status": "present",
          "notes": ""
        },
        "25010164": {
          "status": "present",
          "notes": ""
        },
        "25010165": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010167": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010169": {
          "status": "present",
          "notes": ""
        },
        "25010171": {
          "status": "absent",
          "notes": ""
        },
        "25010175": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010182": {
          "status": "present",
          "notes": ""
        },
        "25010184": {
          "status": "present",
          "notes": ""
        },
        "25010185": {
          "status": "present",
          "notes": ""
        },
        "25010186": {
          "status": "present",
          "notes": ""
        },
        "25010194": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010197": {
          "status": "present",
          "notes": ""
        },
        "25010200": {
          "status": "present",
          "notes": ""
        },
        "25010203": {
          "status": "present",
          "notes": ""
        },
        "25010204": {
          "status": "present",
          "notes": ""
        },
        "25010205": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010207": {
          "status": "present",
          "notes": ""
        },
        "25010209": {
          "status": "present",
          "notes": ""
        },
        "25010210": {
          "status": "present",
          "notes": ""
        },
        "25010211": {
          "status": "present",
          "notes": ""
        },
        "25010213": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010214": {
          "status": "absent",
          "notes": ""
        },
        "25010215": {
          "status": "present",
          "notes": ""
        },
        "25010216": {
          "status": "present",
          "notes": ""
        },
        "25010219": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010227": {
          "status": "present",
          "notes": ""
        },
        "25010231": {
          "status": "absent",
          "notes": ""
        },
        "25010232": {
          "status": "absent",
          "notes": ""
        },
        "25010235": {
          "status": "present",
          "notes": ""
        },
        "25010245": {
          "status": "present",
          "notes": ""
        },
        "25010255": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010256": {
          "status": "present",
          "notes": ""
        },
        "25010258": {
          "status": "absent",
          "notes": ""
        },
        "25010265": {
          "status": "present",
          "notes": ""
        },
        "25010266": {
          "status": "present",
          "notes": ""
        },
        "25010268": {
          "status": "absent",
          "notes": ""
        },
        "25010270": {
          "status": "present",
          "notes": ""
        },
        "25010271": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010274": {
          "status": "present",
          "notes": ""
        },
        "25010278": {
          "status": "present",
          "notes": ""
        },
        "25010279": {
          "status": "present",
          "notes": ""
        },
        "25010280": {
          "status": "present",
          "notes": ""
        },
        "25010287": {
          "status": "present",
          "notes": ""
        },
        "25010289": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010298": {
          "status": "present",
          "notes": ""
        },
        "25010299": {
          "status": "present",
          "notes": ""
        },
        "25010305": {
          "status": "present",
          "notes": ""
        },
        "25010306": {
          "status": "present",
          "notes": ""
        },
        "25010311": {
          "status": "present",
          "notes": ""
        },
        "25010312": {
          "status": "present",
          "notes": ""
        },
        "25010315": {
          "status": "present",
          "notes": ""
        },
        "25010318": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010319": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010320": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010324": {
          "status": "present",
          "notes": ""
        },
        "25010326": {
          "status": "present",
          "notes": ""
        },
        "25010330": {
          "status": "present",
          "notes": ""
        },
        "25010331": {
          "status": "present",
          "notes": ""
        },
        "25010335": {
          "status": "absent",
          "notes": ""
        },
        "25010337": {
          "status": "present",
          "notes": ""
        },
        "25010340": {
          "status": "present",
          "notes": ""
        },
        "25010341": {
          "status": "present",
          "notes": ""
        },
        "25010343": {
          "status": "present",
          "notes": ""
        },
        "25010344": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010346": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010347": {
          "status": "present",
          "notes": ""
        },
        "25010352": {
          "status": "present",
          "notes": ""
        },
        "25010355": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010365": {
          "status": "present",
          "notes": ""
        },
        "25010372": {
          "status": "present",
          "notes": ""
        },
        "25010376": {
          "status": "present",
          "notes": ""
        },
        "25010392": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010396": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010397": {
          "status": "present",
          "notes": ""
        },
        "25010407": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010413": {
          "status": "present",
          "notes": ""
        },
        "25010417": {
          "status": "present",
          "notes": ""
        },
        "25010419": {
          "status": "present",
          "notes": ""
        },
        "25010423": {
          "status": "present",
          "notes": ""
        },
        "25010426": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010429": {
          "status": "present",
          "notes": ""
        },
        "25010432": {
          "status": "present",
          "notes": ""
        },
        "25010433": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010438": {
          "status": "present",
          "notes": ""
        },
        "25010449": {
          "status": "present",
          "notes": ""
        },
        "25010450": {
          "status": "present",
          "notes": ""
        },
        "25010456": {
          "status": "present",
          "notes": ""
        },
        "25010458": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010460": {
          "status": "present",
          "notes": ""
        },
        "25010464": {
          "status": "present",
          "notes": ""
        },
        "25010466": {
          "status": "present",
          "notes": ""
        },
        "25010468": {
          "status": "present",
          "notes": ""
        },
        "25010472": {
          "status": "present",
          "notes": ""
        },
        "25010474": {
          "status": "absent",
          "notes": ""
        },
        "25010478": {
          "status": "present",
          "notes": ""
        },
        "25010482": {
          "status": "present",
          "notes": ""
        },
        "25010485": {
          "status": "present",
          "notes": ""
        },
        "25010486": {
          "status": "present",
          "notes": ""
        },
        "25010488": {
          "status": "present",
          "notes": ""
        },
        "25010493": {
          "status": "present",
          "notes": ""
        },
        "25010494": {
          "status": "absent",
          "notes": ""
        },
        "25010495": {
          "status": "present",
          "notes": ""
        },
        "25010496": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010497": {
          "status": "present",
          "notes": ""
        },
        "25010503": {
          "status": "absent",
          "notes": ""
        },
        "25010506": {
          "status": "present",
          "notes": ""
        },
        "25010512": {
          "status": "present",
          "notes": ""
        },
        "25010518": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010521": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010522": {
          "status": "present",
          "notes": ""
        },
        "25010523": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010524": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010525": {
          "status": "present",
          "notes": ""
        },
        "25010529": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010536": {
          "status": "present",
          "notes": ""
        }
      },
      "updatedAt": "2026-09-30T12:00:00.000Z"
    },
    "data_communication_GA_w3": {
      "course": "data_communication",
      "group": "GA",
      "week": 3,
      "timestamp": "2026-10-07T12:00:00.000Z",
      "instructor": "م. أحمد الخطيب",
      "records": {
        "25010002": {
          "status": "present",
          "notes": ""
        },
        "25010003": {
          "status": "present",
          "notes": ""
        },
        "25010009": {
          "status": "present",
          "notes": ""
        },
        "25010014": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010021": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010023": {
          "status": "present",
          "notes": ""
        },
        "25010031": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010032": {
          "status": "present",
          "notes": ""
        },
        "25010033": {
          "status": "present",
          "notes": ""
        },
        "25010034": {
          "status": "present",
          "notes": ""
        },
        "25010035": {
          "status": "present",
          "notes": ""
        },
        "25010045": {
          "status": "present",
          "notes": ""
        },
        "25010049": {
          "status": "present",
          "notes": ""
        },
        "25010051": {
          "status": "present",
          "notes": ""
        },
        "25010052": {
          "status": "present",
          "notes": ""
        },
        "25010053": {
          "status": "present",
          "notes": ""
        },
        "25010054": {
          "status": "present",
          "notes": ""
        },
        "25010058": {
          "status": "present",
          "notes": ""
        },
        "25010060": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010063": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010067": {
          "status": "absent",
          "notes": ""
        },
        "25010078": {
          "status": "present",
          "notes": ""
        },
        "25010079": {
          "status": "present",
          "notes": ""
        },
        "25010097": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010103": {
          "status": "present",
          "notes": ""
        },
        "25010106": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010112": {
          "status": "absent",
          "notes": ""
        },
        "25010121": {
          "status": "present",
          "notes": ""
        },
        "25010124": {
          "status": "present",
          "notes": ""
        },
        "25010129": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010137": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010138": {
          "status": "present",
          "notes": ""
        },
        "25010147": {
          "status": "present",
          "notes": ""
        },
        "25010152": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010156": {
          "status": "present",
          "notes": ""
        },
        "25010170": {
          "status": "present",
          "notes": ""
        },
        "25010178": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010179": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010190": {
          "status": "present",
          "notes": ""
        },
        "25010191": {
          "status": "present",
          "notes": ""
        },
        "25010192": {
          "status": "present",
          "notes": ""
        },
        "25010195": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010196": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010198": {
          "status": "absent",
          "notes": ""
        },
        "25010217": {
          "status": "present",
          "notes": ""
        },
        "25010223": {
          "status": "present",
          "notes": ""
        },
        "25010225": {
          "status": "present",
          "notes": ""
        },
        "25010234": {
          "status": "present",
          "notes": ""
        },
        "25010236": {
          "status": "present",
          "notes": ""
        },
        "25010237": {
          "status": "present",
          "notes": ""
        },
        "25010238": {
          "status": "present",
          "notes": ""
        },
        "25010239": {
          "status": "present",
          "notes": ""
        },
        "25010242": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010243": {
          "status": "absent",
          "notes": ""
        },
        "25010244": {
          "status": "present",
          "notes": ""
        },
        "25010247": {
          "status": "present",
          "notes": ""
        },
        "25010249": {
          "status": "present",
          "notes": ""
        },
        "25010250": {
          "status": "present",
          "notes": ""
        },
        "25010253": {
          "status": "present",
          "notes": ""
        },
        "25010254": {
          "status": "present",
          "notes": ""
        },
        "25010259": {
          "status": "present",
          "notes": ""
        },
        "25010261": {
          "status": "absent",
          "notes": ""
        },
        "25010264": {
          "status": "present",
          "notes": ""
        },
        "25010269": {
          "status": "present",
          "notes": ""
        },
        "25010272": {
          "status": "absent",
          "notes": ""
        },
        "25010273": {
          "status": "present",
          "notes": ""
        },
        "25010275": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010282": {
          "status": "present",
          "notes": ""
        },
        "25010283": {
          "status": "present",
          "notes": ""
        },
        "25010286": {
          "status": "absent",
          "notes": ""
        },
        "25010288": {
          "status": "present",
          "notes": ""
        },
        "25010290": {
          "status": "present",
          "notes": ""
        },
        "25010291": {
          "status": "present",
          "notes": ""
        },
        "25010292": {
          "status": "absent",
          "notes": ""
        },
        "25010293": {
          "status": "absent",
          "notes": ""
        },
        "25010294": {
          "status": "absent",
          "notes": ""
        },
        "25010295": {
          "status": "present",
          "notes": ""
        },
        "25010296": {
          "status": "present",
          "notes": ""
        },
        "25010300": {
          "status": "absent",
          "notes": ""
        },
        "25010301": {
          "status": "present",
          "notes": ""
        },
        "25010302": {
          "status": "present",
          "notes": ""
        },
        "25010303": {
          "status": "absent",
          "notes": ""
        },
        "25010304": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010307": {
          "status": "absent",
          "notes": ""
        },
        "25010309": {
          "status": "present",
          "notes": ""
        },
        "25010310": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010313": {
          "status": "present",
          "notes": ""
        },
        "25010321": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010322": {
          "status": "present",
          "notes": ""
        },
        "25010327": {
          "status": "present",
          "notes": ""
        },
        "25010328": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010329": {
          "status": "present",
          "notes": ""
        },
        "25010332": {
          "status": "present",
          "notes": ""
        },
        "25010336": {
          "status": "present",
          "notes": ""
        },
        "25010345": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010348": {
          "status": "present",
          "notes": ""
        },
        "25010350": {
          "status": "present",
          "notes": ""
        },
        "25010353": {
          "status": "present",
          "notes": ""
        },
        "25010359": {
          "status": "present",
          "notes": ""
        },
        "25010362": {
          "status": "absent",
          "notes": ""
        },
        "25010364": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010366": {
          "status": "present",
          "notes": ""
        },
        "25010367": {
          "status": "present",
          "notes": ""
        },
        "25010370": {
          "status": "present",
          "notes": ""
        },
        "25010371": {
          "status": "present",
          "notes": ""
        },
        "25010373": {
          "status": "present",
          "notes": ""
        },
        "25010374": {
          "status": "present",
          "notes": ""
        },
        "25010377": {
          "status": "present",
          "notes": ""
        },
        "25010378": {
          "status": "present",
          "notes": ""
        },
        "25010381": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010385": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010386": {
          "status": "present",
          "notes": ""
        },
        "25010387": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010388": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010391": {
          "status": "absent",
          "notes": ""
        },
        "25010393": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010394": {
          "status": "present",
          "notes": ""
        },
        "25010399": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010400": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010401": {
          "status": "present",
          "notes": ""
        },
        "25010402": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010403": {
          "status": "present",
          "notes": ""
        },
        "25010409": {
          "status": "present",
          "notes": ""
        },
        "25010410": {
          "status": "present",
          "notes": ""
        },
        "25010411": {
          "status": "present",
          "notes": ""
        },
        "25010412": {
          "status": "present",
          "notes": ""
        },
        "25010416": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010420": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010422": {
          "status": "present",
          "notes": ""
        },
        "25010427": {
          "status": "present",
          "notes": ""
        },
        "25010428": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010434": {
          "status": "present",
          "notes": ""
        },
        "25010437": {
          "status": "present",
          "notes": ""
        },
        "25010439": {
          "status": "present",
          "notes": ""
        },
        "25010442": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010443": {
          "status": "present",
          "notes": ""
        },
        "25010451": {
          "status": "absent",
          "notes": ""
        },
        "25010452": {
          "status": "absent",
          "notes": ""
        },
        "25010453": {
          "status": "present",
          "notes": ""
        },
        "25010457": {
          "status": "present",
          "notes": ""
        },
        "25010462": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010467": {
          "status": "present",
          "notes": ""
        },
        "25010471": {
          "status": "present",
          "notes": ""
        },
        "25010473": {
          "status": "absent",
          "notes": ""
        },
        "25010476": {
          "status": "present",
          "notes": ""
        },
        "25010480": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010481": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010483": {
          "status": "present",
          "notes": ""
        },
        "25010484": {
          "status": "present",
          "notes": ""
        },
        "25010487": {
          "status": "present",
          "notes": ""
        },
        "25010489": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010492": {
          "status": "absent",
          "notes": ""
        },
        "25010498": {
          "status": "present",
          "notes": ""
        },
        "25010499": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010502": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010504": {
          "status": "absent",
          "notes": ""
        },
        "25010510": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010515": {
          "status": "absent",
          "notes": ""
        },
        "25010516": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010526": {
          "status": "absent",
          "notes": ""
        },
        "25010528": {
          "status": "present",
          "notes": ""
        },
        "25010531": {
          "status": "present",
          "notes": ""
        },
        "25010535": {
          "status": "present",
          "notes": ""
        },
        "25010537": {
          "status": "present",
          "notes": ""
        }
      }
    },
    "data_communication_GB_w3": {
      "course": "data_communication",
      "group": "GB",
      "week": 3,
      "timestamp": "2026-10-07T12:00:00.000Z",
      "instructor": "م. أحمد الخطيب",
      "records": {
        "25010004": {
          "status": "present",
          "notes": ""
        },
        "25010008": {
          "status": "absent",
          "notes": ""
        },
        "25010010": {
          "status": "present",
          "notes": ""
        },
        "25010012": {
          "status": "present",
          "notes": ""
        },
        "25010016": {
          "status": "present",
          "notes": ""
        },
        "25010018": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010019": {
          "status": "present",
          "notes": ""
        },
        "25010026": {
          "status": "present",
          "notes": ""
        },
        "25010029": {
          "status": "present",
          "notes": ""
        },
        "25010038": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010043": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010046": {
          "status": "present",
          "notes": ""
        },
        "25010047": {
          "status": "present",
          "notes": ""
        },
        "25010055": {
          "status": "present",
          "notes": ""
        },
        "25010057": {
          "status": "absent",
          "notes": ""
        },
        "25010059": {
          "status": "present",
          "notes": ""
        },
        "25010061": {
          "status": "present",
          "notes": ""
        },
        "25010065": {
          "status": "present",
          "notes": ""
        },
        "25010070": {
          "status": "present",
          "notes": ""
        },
        "25010080": {
          "status": "present",
          "notes": ""
        },
        "25010081": {
          "status": "present",
          "notes": ""
        },
        "25010082": {
          "status": "present",
          "notes": ""
        },
        "25010084": {
          "status": "present",
          "notes": ""
        },
        "25010095": {
          "status": "absent",
          "notes": ""
        },
        "25010096": {
          "status": "absent",
          "notes": ""
        },
        "25010100": {
          "status": "present",
          "notes": ""
        },
        "25010107": {
          "status": "present",
          "notes": ""
        },
        "25010110": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010113": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010114": {
          "status": "present",
          "notes": ""
        },
        "25010130": {
          "status": "absent",
          "notes": ""
        },
        "25010141": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010144": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010145": {
          "status": "present",
          "notes": ""
        },
        "25010146": {
          "status": "absent",
          "notes": ""
        },
        "25010148": {
          "status": "present",
          "notes": ""
        },
        "25010150": {
          "status": "present",
          "notes": ""
        },
        "25010153": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010155": {
          "status": "present",
          "notes": ""
        },
        "25010158": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010160": {
          "status": "present",
          "notes": ""
        },
        "25010161": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010162": {
          "status": "absent",
          "notes": ""
        },
        "25010168": {
          "status": "present",
          "notes": ""
        },
        "25010172": {
          "status": "present",
          "notes": ""
        },
        "25010173": {
          "status": "present",
          "notes": ""
        },
        "25010174": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010177": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010180": {
          "status": "present",
          "notes": ""
        },
        "25010187": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010188": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010189": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010193": {
          "status": "present",
          "notes": ""
        },
        "25010199": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010201": {
          "status": "present",
          "notes": ""
        },
        "25010202": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010218": {
          "status": "absent",
          "notes": ""
        },
        "25010220": {
          "status": "absent",
          "notes": ""
        },
        "25010221": {
          "status": "present",
          "notes": ""
        },
        "25010222": {
          "status": "present",
          "notes": ""
        },
        "25010228": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010229": {
          "status": "present",
          "notes": ""
        },
        "25010233": {
          "status": "present",
          "notes": ""
        },
        "25010246": {
          "status": "absent",
          "notes": ""
        },
        "25010248": {
          "status": "present",
          "notes": ""
        },
        "25010251": {
          "status": "present",
          "notes": ""
        },
        "25010263": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010267": {
          "status": "present",
          "notes": ""
        },
        "25010276": {
          "status": "present",
          "notes": ""
        },
        "25010277": {
          "status": "present",
          "notes": ""
        },
        "25010281": {
          "status": "present",
          "notes": ""
        },
        "25010284": {
          "status": "absent",
          "notes": ""
        },
        "25010285": {
          "status": "absent",
          "notes": ""
        },
        "25010308": {
          "status": "present",
          "notes": ""
        },
        "25010317": {
          "status": "present",
          "notes": ""
        },
        "25010323": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010325": {
          "status": "present",
          "notes": ""
        },
        "25010334": {
          "status": "present",
          "notes": ""
        },
        "25010338": {
          "status": "present",
          "notes": ""
        },
        "25010339": {
          "status": "present",
          "notes": ""
        },
        "25010342": {
          "status": "present",
          "notes": ""
        },
        "25010349": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010351": {
          "status": "present",
          "notes": ""
        },
        "25010354": {
          "status": "present",
          "notes": ""
        },
        "25010356": {
          "status": "present",
          "notes": ""
        },
        "25010357": {
          "status": "present",
          "notes": ""
        },
        "25010358": {
          "status": "present",
          "notes": ""
        },
        "25010360": {
          "status": "present",
          "notes": ""
        },
        "25010363": {
          "status": "absent",
          "notes": ""
        },
        "25010368": {
          "status": "present",
          "notes": ""
        },
        "25010379": {
          "status": "present",
          "notes": ""
        },
        "25010380": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010383": {
          "status": "present",
          "notes": ""
        },
        "25010384": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010389": {
          "status": "absent",
          "notes": ""
        },
        "25010395": {
          "status": "absent",
          "notes": ""
        },
        "25010398": {
          "status": "absent",
          "notes": ""
        },
        "25010404": {
          "status": "present",
          "notes": ""
        },
        "25010405": {
          "status": "present",
          "notes": ""
        },
        "25010406": {
          "status": "present",
          "notes": ""
        },
        "25010408": {
          "status": "present",
          "notes": ""
        },
        "25010414": {
          "status": "present",
          "notes": ""
        },
        "25010415": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010418": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010421": {
          "status": "present",
          "notes": ""
        },
        "25010424": {
          "status": "present",
          "notes": ""
        },
        "25010430": {
          "status": "present",
          "notes": ""
        },
        "25010431": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010435": {
          "status": "absent",
          "notes": ""
        },
        "25010436": {
          "status": "present",
          "notes": ""
        },
        "25010440": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010441": {
          "status": "present",
          "notes": ""
        },
        "25010444": {
          "status": "present",
          "notes": ""
        },
        "25010445": {
          "status": "absent",
          "notes": ""
        },
        "25010446": {
          "status": "present",
          "notes": ""
        },
        "25010447": {
          "status": "present",
          "notes": ""
        },
        "25010448": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010454": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010455": {
          "status": "present",
          "notes": ""
        },
        "25010459": {
          "status": "present",
          "notes": ""
        },
        "25010469": {
          "status": "present",
          "notes": ""
        },
        "25010479": {
          "status": "present",
          "notes": ""
        },
        "25010491": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010500": {
          "status": "absent",
          "notes": ""
        },
        "25010501": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010505": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010507": {
          "status": "present",
          "notes": ""
        },
        "25010508": {
          "status": "present",
          "notes": ""
        },
        "25010509": {
          "status": "absent",
          "notes": ""
        },
        "25010513": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010514": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010517": {
          "status": "present",
          "notes": ""
        },
        "25010527": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010530": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010532": {
          "status": "present",
          "notes": ""
        },
        "25010533": {
          "status": "present",
          "notes": ""
        },
        "25010534": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010538": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010539": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010540": {
          "status": "present",
          "notes": ""
        },
        "25010541": {
          "status": "absent",
          "notes": ""
        },
        "25010542": {
          "status": "present",
          "notes": ""
        }
      }
    },
    "data_communication_GC_w3": {
      "course": "data_communication",
      "group": "GC",
      "week": 3,
      "timestamp": "2026-10-07T12:00:00.000Z",
      "instructor": "م. أحمد الخطيب",
      "records": {
        "25010001": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010005": {
          "status": "present",
          "notes": ""
        },
        "25010006": {
          "status": "present",
          "notes": ""
        },
        "25010007": {
          "status": "present",
          "notes": ""
        },
        "25010011": {
          "status": "present",
          "notes": ""
        },
        "25010013": {
          "status": "present",
          "notes": ""
        },
        "25010020": {
          "status": "present",
          "notes": ""
        },
        "25010024": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010025": {
          "status": "absent",
          "notes": ""
        },
        "25010027": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010036": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010039": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010040": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010042": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010044": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010048": {
          "status": "present",
          "notes": ""
        },
        "25010050": {
          "status": "present",
          "notes": ""
        },
        "25010056": {
          "status": "present",
          "notes": ""
        },
        "25010062": {
          "status": "present",
          "notes": ""
        },
        "25010064": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010066": {
          "status": "present",
          "notes": ""
        },
        "25010068": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010069": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010071": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010072": {
          "status": "present",
          "notes": ""
        },
        "25010073": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010075": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010076": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010077": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010086": {
          "status": "present",
          "notes": ""
        },
        "25010087": {
          "status": "absent",
          "notes": ""
        },
        "25010088": {
          "status": "present",
          "notes": ""
        },
        "25010089": {
          "status": "present",
          "notes": ""
        },
        "25010091": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010092": {
          "status": "present",
          "notes": ""
        },
        "25010094": {
          "status": "present",
          "notes": ""
        },
        "25010101": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010102": {
          "status": "present",
          "notes": ""
        },
        "25010104": {
          "status": "present",
          "notes": ""
        },
        "25010105": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010108": {
          "status": "present",
          "notes": ""
        },
        "25010109": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010115": {
          "status": "present",
          "notes": ""
        },
        "25010116": {
          "status": "present",
          "notes": ""
        },
        "25010117": {
          "status": "present",
          "notes": ""
        },
        "25010118": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010119": {
          "status": "present",
          "notes": ""
        },
        "25010122": {
          "status": "present",
          "notes": ""
        },
        "25010123": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010126": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010127": {
          "status": "present",
          "notes": ""
        },
        "25010128": {
          "status": "present",
          "notes": ""
        },
        "25010131": {
          "status": "present",
          "notes": ""
        },
        "25010132": {
          "status": "present",
          "notes": ""
        },
        "25010133": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010135": {
          "status": "absent",
          "notes": ""
        },
        "25010136": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010139": {
          "status": "present",
          "notes": ""
        },
        "25010142": {
          "status": "present",
          "notes": ""
        },
        "25010143": {
          "status": "present",
          "notes": ""
        },
        "25010149": {
          "status": "present",
          "notes": ""
        },
        "25010154": {
          "status": "present",
          "notes": ""
        },
        "25010159": {
          "status": "present",
          "notes": ""
        },
        "25010163": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010164": {
          "status": "present",
          "notes": ""
        },
        "25010165": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010167": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010169": {
          "status": "present",
          "notes": ""
        },
        "25010171": {
          "status": "absent",
          "notes": ""
        },
        "25010175": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010182": {
          "status": "absent",
          "notes": ""
        },
        "25010184": {
          "status": "present",
          "notes": ""
        },
        "25010185": {
          "status": "present",
          "notes": ""
        },
        "25010186": {
          "status": "present",
          "notes": ""
        },
        "25010194": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010197": {
          "status": "present",
          "notes": ""
        },
        "25010200": {
          "status": "present",
          "notes": ""
        },
        "25010203": {
          "status": "present",
          "notes": ""
        },
        "25010204": {
          "status": "present",
          "notes": ""
        },
        "25010205": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010207": {
          "status": "absent",
          "notes": ""
        },
        "25010209": {
          "status": "present",
          "notes": ""
        },
        "25010210": {
          "status": "present",
          "notes": ""
        },
        "25010211": {
          "status": "present",
          "notes": ""
        },
        "25010213": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010214": {
          "status": "absent",
          "notes": ""
        },
        "25010215": {
          "status": "present",
          "notes": ""
        },
        "25010216": {
          "status": "present",
          "notes": ""
        },
        "25010219": {
          "status": "present",
          "notes": ""
        },
        "25010227": {
          "status": "present",
          "notes": ""
        },
        "25010231": {
          "status": "present",
          "notes": ""
        },
        "25010232": {
          "status": "absent",
          "notes": ""
        },
        "25010235": {
          "status": "present",
          "notes": ""
        },
        "25010245": {
          "status": "present",
          "notes": ""
        },
        "25010255": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010256": {
          "status": "present",
          "notes": ""
        },
        "25010258": {
          "status": "absent",
          "notes": ""
        },
        "25010265": {
          "status": "present",
          "notes": ""
        },
        "25010266": {
          "status": "present",
          "notes": ""
        },
        "25010268": {
          "status": "present",
          "notes": ""
        },
        "25010270": {
          "status": "present",
          "notes": ""
        },
        "25010271": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010274": {
          "status": "present",
          "notes": ""
        },
        "25010278": {
          "status": "present",
          "notes": ""
        },
        "25010279": {
          "status": "present",
          "notes": ""
        },
        "25010280": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010287": {
          "status": "present",
          "notes": ""
        },
        "25010289": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010298": {
          "status": "present",
          "notes": ""
        },
        "25010299": {
          "status": "present",
          "notes": ""
        },
        "25010305": {
          "status": "present",
          "notes": ""
        },
        "25010306": {
          "status": "present",
          "notes": ""
        },
        "25010311": {
          "status": "present",
          "notes": ""
        },
        "25010312": {
          "status": "present",
          "notes": ""
        },
        "25010315": {
          "status": "present",
          "notes": ""
        },
        "25010318": {
          "status": "present",
          "notes": ""
        },
        "25010319": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010320": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010324": {
          "status": "present",
          "notes": ""
        },
        "25010326": {
          "status": "present",
          "notes": ""
        },
        "25010330": {
          "status": "present",
          "notes": ""
        },
        "25010331": {
          "status": "present",
          "notes": ""
        },
        "25010335": {
          "status": "present",
          "notes": ""
        },
        "25010337": {
          "status": "present",
          "notes": ""
        },
        "25010340": {
          "status": "present",
          "notes": ""
        },
        "25010341": {
          "status": "present",
          "notes": ""
        },
        "25010343": {
          "status": "present",
          "notes": ""
        },
        "25010344": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010346": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010347": {
          "status": "present",
          "notes": ""
        },
        "25010352": {
          "status": "present",
          "notes": ""
        },
        "25010355": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010365": {
          "status": "present",
          "notes": ""
        },
        "25010372": {
          "status": "present",
          "notes": ""
        },
        "25010376": {
          "status": "present",
          "notes": ""
        },
        "25010392": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010396": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010397": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010407": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010413": {
          "status": "present",
          "notes": ""
        },
        "25010417": {
          "status": "present",
          "notes": ""
        },
        "25010419": {
          "status": "present",
          "notes": ""
        },
        "25010423": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010426": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010429": {
          "status": "absent",
          "notes": ""
        },
        "25010432": {
          "status": "present",
          "notes": ""
        },
        "25010433": {
          "status": "present",
          "notes": "تم اعتماد الحضور للأسبوع بالكامل"
        },
        "25010438": {
          "status": "present",
          "notes": ""
        },
        "25010449": {
          "status": "present",
          "notes": ""
        },
        "25010450": {
          "status": "present",
          "notes": ""
        },
        "25010456": {
          "status": "present",
          "notes": ""
        },
        "25010458": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010460": {
          "status": "present",
          "notes": ""
        },
        "25010464": {
          "status": "present",
          "notes": ""
        },
        "25010466": {
          "status": "present",
          "notes": ""
        },
        "25010468": {
          "status": "absent",
          "notes": ""
        },
        "25010472": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010474": {
          "status": "present",
          "notes": ""
        },
        "25010478": {
          "status": "present",
          "notes": ""
        },
        "25010482": {
          "status": "present",
          "notes": ""
        },
        "25010485": {
          "status": "present",
          "notes": ""
        },
        "25010486": {
          "status": "present",
          "notes": ""
        },
        "25010488": {
          "status": "present",
          "notes": ""
        },
        "25010493": {
          "status": "present",
          "notes": ""
        },
        "25010494": {
          "status": "absent",
          "notes": ""
        },
        "25010495": {
          "status": "present",
          "notes": ""
        },
        "25010496": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010497": {
          "status": "present",
          "notes": ""
        },
        "25010503": {
          "status": "present",
          "notes": ""
        },
        "25010506": {
          "status": "present",
          "notes": ""
        },
        "25010512": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010518": {
          "status": "present",
          "notes": ""
        },
        "25010521": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010522": {
          "status": "present",
          "notes": ""
        },
        "25010523": {
          "status": "present",
          "notes": "حاضر معتمد"
        },
        "25010524": {
          "status": "present",
          "notes": ""
        },
        "25010525": {
          "status": "present",
          "notes": ""
        },
        "25010529": {
          "status": "present",
          "notes": "تم تصحيح الغياب بناءً على إفادة الطالب"
        },
        "25010536": {
          "status": "present",
          "notes": ""
        }
      }
    }
  },
  "bonuses": [
    {
      "id": "bonus_dc_1",
      "studentId": "25010304",
      "studentName": "حازم سعيد مصطفى عبد العليم مصطفى",
      "courseId": "data_communication",
      "groupId": "GA",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_2",
      "studentId": "25010457",
      "studentName": "محمد عزت جامع احمد",
      "courseId": "data_communication",
      "groupId": "GA",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_3",
      "studentId": "25010259",
      "studentName": "احمد محمد عز الدين على",
      "courseId": "data_communication",
      "groupId": "GA",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_4",
      "studentId": "25010137",
      "studentName": "فلوباتير يوحنا صبرى عطيه",
      "courseId": "data_communication",
      "groupId": "GA",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_5",
      "studentId": "25010459",
      "studentName": "محمد عصام محمد جمال مصطفى",
      "courseId": "data_communication",
      "groupId": "GB",
      "week": "3",
      "points": 10,
      "reason": "تفوق وتفاعل استثنائي في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_6",
      "studentId": "25010016",
      "studentName": "احمد ربيع احمد مرغنى جاد الله",
      "courseId": "data_communication",
      "groupId": "GB",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_7",
      "studentId": "25010145",
      "studentName": "مارك جرجس عزت نصر سفين",
      "courseId": "data_communication",
      "groupId": "GB",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_8",
      "studentId": "25010517",
      "studentName": "نوران ايمن محمد حسان",
      "courseId": "data_communication",
      "groupId": "GB",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_9",
      "studentId": "25010393",
      "studentName": "عبد الله عمر محمد عوض إبراهيم",
      "courseId": "data_communication",
      "groupId": "GA",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_10",
      "studentId": "25010325",
      "studentName": "رؤيه ايمن محمد احمد",
      "courseId": "data_communication",
      "groupId": "GB",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_11",
      "studentId": "25010522",
      "studentName": "هايدى محمد فوزى حسن امام",
      "courseId": "data_communication",
      "groupId": "GC",
      "week": "3",
      "points": 10,
      "reason": "تفوق وتفاعل استثنائي في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_12",
      "studentId": "25010072",
      "studentName": "دينا عبد الله احمد بصرى",
      "courseId": "data_communication",
      "groupId": "GC",
      "week": "3",
      "points": 10,
      "reason": "تفوق وتفاعل استثنائي في السكشن",
      "date": "2026-10-09"
    },
    {
      "id": "bonus_dc_13",
      "studentId": "25010323",
      "studentName": "داليا عبد الحليم احمد حفنى الطاهر",
      "courseId": "data_communication",
      "groupId": "GB",
      "week": "3",
      "points": 5,
      "reason": "مشاركة وتفاعل متميز في السكشن",
      "date": "2026-10-09"
    }
  ],
  "instructors": {
    "ahmed": {
      "id": "ahmed",
      "name": "م. أحمد الخطيب",
      "pin": "root",
      "role": "admin"
    },
    "engy": {
      "id": "engy",
      "name": "م. إنجي",
      "pin": "1234",
      "role": "instructor"
    },
    "nada": {
      "id": "nada",
      "name": "م. ندى",
      "pin": "5678",
      "role": "instructor"
    }
  }
};
